itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>STATCLR</name>
                    <description>Signature generation status clear register</description>
                    <addressOffset>0xFE8</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>SIG_DONE_CLR</name>
                            <description>Writing a 1 to this bits clears the signature generation
                                completion flag (SIG_DONE) in the FMSTAT register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[25:3]</bitRange>
                        </field>
                        <field>
                            <name>RDWR_CLR_ST</name>
                            <description>Clear read/write operation finished interrupt status bit
                                (EEPROM). 0 leave corresponding bit unchanged. 1 clear corresponding
                                bit.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PROG1_CLR_ST</name>
                            <description>Clear program operation finished interrupt status bit for
                                EEPROM device 1. 0 leave corresponding bit unchanged. 1 clear
                                corresponding bit.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:29]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ENCLR</name>
                    <description>EEPROM interrupt enable clear</description>
                    <addressOffset>0xFD8</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[25:0]</bitRange>
                        </field>
                        <field>
                            <name>RDWR_CLR_EN</name>
                            <description>Clear read/write operation finished interrupt enable bit
                                (EEPROM). 0: leave corresponding bit unchanged. 1: clear
                                corresponding bit.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PROG1_CLR_EN</name>
                            <description>Clear program operation finished interrupt enable bit for
                                EEPROM device 1. 0: leave corresponding bit unchanged. 1: clear
                                corresponding bit.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:29]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ENSET</name>
                    <description>EEPROM interrupt enable set</description>
                    <addressOffset>0xFDC</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[25:0]</bitRange>
                        </field>
                        <field>
                            <name>RDWR_SET_EN</name>
                            <description>Set read/write operation finished interrupt enable bit
                                (EEPROM). 0: leave corresponding bit unchanged. 1: set corresponding
                                bit.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PROG1_SET_EN</name>
                            <description>Set program operation finished interrupt enable bit for
                                EEPROM device 1. 0: leave corresponding bit unchanged. 1: set
                                corresponding bit.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:29]</bitRange>
                        </field>
                    </fields>
                </register>
