itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>SOFTLBREQ</name>
                    <description>DMA Software Last Burst Request Register</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFTLBREQ0</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ1</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ2</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ3</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ4</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ5</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ6</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ7</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ8</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ9</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ10</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ11</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ12</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ13</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ14</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLBREQ15</name>
                            <description>Software last burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA
                                last burst request for the corresponding request line.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOFTLSREQ</name>
                    <description>DMA Software Last Single Request Register</description>
                    <addressOffset>0x02C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFTLSREQ0</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ1</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ2</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ3</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ4</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ5</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ6</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ7</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ8</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ9</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ10</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ11</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ12</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ13</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ14</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>SOFTLSREQ15</name>
                            <description>Software last single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA last single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CONFIG</name>
                    <description>DMA Configuration Register</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>E</name>
                            <description>DMA Controller enable: 0 = disabled (default). Disabling
                                the DMA Controller reduces power consumption. 1 = enabled.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>M</name>
                            <description>AHB Master endianness configuration: 0 = little-endian mode
                                (default). 1 = big-endian mode.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
