itzandroidtab/klib-svd/lpc1788.svd
                    <register>
                        <name>CONFIG</name>
                        <description>DMA Channel 0 Configuration Register[1]</description>
                        <addressOffset>0x10</addressOffset>
                        <access>read-write</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>E</name>
                                <description>Channel enable. Reading this bit indicates whether a
                                    channel is currently enabled or disabled: 0 = channel disabled.
                                    1 = channel enabled. The Channel Enable bit status can also be
                                    found by reading the DMACEnbldChns Register. A channel is
                                    enabled by setting this bit. A channel can be disabled by
                                    clearing the Enable bit. This causes the current AHB transfer
                                    (if one is in progress) to complete and the channel is then
                                    disabled. Any data in the FIFO of the relevant channel is lost.
                                    Restarting the channel by setting the Channel Enable bit has
                                    unpredictable effects, the channel must be fully re-initialized.
                                    The channel is also disabled, and Channel Enable bit cleared,
                                    when the last LLI is reached, the DMA transfer is completed, or
                                    if a channel error is encountered. If a channel must be disabled
                                    without losing data in the FIFO, the Halt bit must be set so
                                    that further DMA requests are ignored. The Active bit must then
                                    be polled until it reaches 0, indicating that there is no data
                                    left in the FIFO. Finally, the Channel Enable bit can be
                                    cleared.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>SRCPERIPHERAL</name>
                                <description>Source peripheral. This value selects the DMA source
                                    request peripheral. This field is ignored if the source of the
                                    transfer is from memory. See Table 672 for peripheral
                                    identification.</description>
                                <bitRange>[5:1]</bitRange>
                            </field>
                            <field>
                                <name>DESTPERIPHERAL</name>
                                <description>Destination peripheral. This value selects the DMA
                                    destination request peripheral. This field is ignored if the
                                    destination of the transfer is to memory. See Table 672 for
                                    peripheral identification.</description>
                                <bitRange>[10:6]</bitRange>
                            </field>
                            <field>
                                <name>TRANSFERTYPE</name>
                                <description>This value indicates the type of transfer and specifies
                                    the flow controller. The transfer type can be memory-to-memory,
                                    memory-to-peripheral, peripheral-to-memory, or
                                    peripheral-to-peripheral. Flow can be controlled by the DMA
                                    controller, the source peripheral, or the destination
                                    peripheral. Refer to Table 694 for the encoding of this field.</description>
                                <bitRange>[13:11]</bitRange>
                            </field>
                            <field>
                                <name>IE</name>
                                <description>Interrupt error mask. When cleared, this bit masks out
                                    the error interrupt of the relevant channel.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>ITC</name>
                                <description>Terminal count interrupt mask. When cleared, this bit
                                    masks out the terminal count interrupt of the relevant channel.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>L</name>
                                <description>Lock. When set, this bit enables locked transfers. This
                                    information is not used in the LPC178x/177x.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>A</name>
                                <description>Active: 0 = there is no data in the FIFO of the
                                    channel. 1 = the channel FIFO has data. This value can be used
                                    with the Halt and Channel Enable bits to cleanly disable a DMA
                                    channel. This is a read-only bit.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>H</name>
                                <description>Halt: 0 = enable DMA requests. 1 = ignore further
                                    source DMA requests. The contents of the channel FIFO are
                                    drained. This value can be used with the Active and Channel
                                    Enable bits to cleanly disable a DMA channel.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved. Read value is undefined, only zero should be
                                    written.</description>
                                <bitRange>[31:19]</bitRange>
                            </field>
                        </fields>
                    </register>
                </cluster>
