itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>LCD</name>
            <description>LCD controller </description>
            <groupName>LCD</groupName>
            <baseAddress>0x20088000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LCD</name>
                <value>37</value>
            </interrupt>
            <registers>
                <register>
                    <name>TIMH</name>
                    <description>Horizontal Timing Control register</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>PPL</name>
                            <description>Pixels-per-line. The PPL bit field specifies the number of
                                pixels in each line or row of the screen. PPL is a 6-bit value that
                                represents between 16 and 1024 pixels per line. PPL counts the
                                number of pixel clocks that occur before the HFP is applied. Program
                                the value required divided by 16, minus 1. Actual pixels-per-line =
                                16 * (PPL + 1). For example, to obtain 320 pixels per line, program
                                PPL as (320/16) -1 = 19.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>HSW</name>
                            <description>Horizontal synchronization pulse width. The 8-bit HSW field
                                specifies the pulse width of the line clock in passive mode, or the
                                horizontal synchronization pulse in active mode. Program with
                                desired value minus 1.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>HFP</name>
                            <description>Horizontal front porch. The 8-bit HFP field sets the number
                                of pixel clock intervals at the end of each line or row of pixels,
                                before the LCD line clock is pulsed. When a complete line of pixels
                                is transmitted to the LCD driver, the value in HFP counts the number
                                of pixel clocks to wait before asserting the line clock. HFP can
                                generate a period of 1-256 pixel clock cycles. Program with desired
                                value minus 1.</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>HBP</name>
                            <description>Horizontal back porch. The 8-bit HBP field is used to
                                specify the number of pixel clock periods inserted at the beginning
                                of each line or row of pixels. After the line clock for the previous
                                line has been deasserted, the value in HBP counts the number of
                                pixel clocks to wait before starting the next display line. HBP can
                                generate a delay of 1-256 pixel clock cycles. Program with desired
                                value minus 1.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMV</name>
                    <description>Vertical Timing Control register</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LPP</name>
                            <description>Lines per panel. This is the number of active lines per
                                screen. The LPP field specifies the total number of lines or rows on
                                the LCD panel being controlled. LPP is a 10-bit value allowing
                                between 1 and 1024 lines. Program the register with the number of
                                lines per LCD panel, minus 1. For dual panel displays, program the
                                register with the number of lines on each of the upper and lower
                                panels.</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                        <field>
                            <name>VSW</name>
                            <description>Vertical synchronization pulse width. This is the number of
                                horizontal synchronization lines. The 6-bit VSW field specifies the
                                pulse width of the vertical synchronization pulse. Program the
                                register with the number of lines required, minus one. The number of
                                horizontal synchronization lines must be small (for example, program
                                to zero) for passive STN LCDs. The higher the value the worse the
                                contrast on STN LCDs.</description>
                            <bitRange>[15:10]</bitRange>
                        </field>
                        <field>
                            <name>VFP</name>
                            <description>Vertical front porch. This is the number of inactive lines
                                at the end of a frame, before the vertical synchronization period.
                                The 8-bit VFP field specifies the number of line clocks to insert at
                                the end of each frame. When a complete frame of pixels is
                                transmitted to the LCD display, the value in VFP is used to count
                                the number of line clock periods to wait. After the count has
                                elapsed, the vertical synchronization signal, LCD_FP, is asserted in
                                active mode, or extra line clocks are inserted as specified by the
                                VSW bit-field in passive mode. VFP generates 0-255 line clock
                                cycles. Program to zero on passive displays for improved contrast.</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>VBP</name>
                            <description>Vertical back porch. This is the number of inactive lines
                                at the start of a frame, after the vertical synchronization period.
                                The 8-bit VBP field specifies the number of line clocks inserted at
                                the beginning of each frame. The VBP count starts immediately after
                                the vertical synchronization signal for the previous frame has been
                                negated for active mode, or the extra line clocks have been inserted
                                as specified by the VSW bit field in passive mode. After this has
                                occurred, the count value in VBP sets the number of line clock
                                periods inserted before the next frame. VBP generates 0 to 255 extra
                                line clock cycles. Program to zero on passive displays for improved
                                contrast.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POL</name>
                    <description>Clock and Signal Polarity Control register</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCD_LO</name>
                            <description>Lower five bits of panel clock divisor. The ten-bit PCD
                                field, comprising PCD_HI (bits 31:27 of this register) and PCD_LO,
                                is used to derive the LCD panel clock frequency LCD_DCLK from the
                                input clock, LCD_DCLK = LCDCLK/(PCD+2). For monochrome STN displays
                                with a 4 or 8-bit interface, the panel clock is a factor of four and
                                eight down from the actual individual pixel clock rate. For color
                                STN displays, 22/3 pixels are output per LCD_DCLK cycle, so the
                                panel clock is 0.375 times the pixel rate. For TFT displays, the
                                pixel clock divider can be bypassed by setting the BCD bit in this
                                register. Note: data path latency forces some restrictions on the
                                usable minimum values for the panel clock divider in STN modes:
                                Single panel color mode, PCD = 1 (LCD_DCLK = LCDCLK/3). Dual panel
                                color mode, PCD = 4 (LCD_DCLK = LCDCLK/6). Single panel monochrome
                                4-bit interface mode, PCD = 2(LCD_DCLK = LCDCLK/4). Dual panel
                                monochrome 4-bit interface mode and single panel monochrome 8-bit
                                interface mode, PCD = 6(LCD_DCLK = LCDCLK/8). Dual panel monochrome
                                8-bit interface mode, PCD = 14(LCD_DCLK = LCDCLK/16).</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>CLKSEL</name>
                            <description>Clock Select. This bit controls the selection of the source
                                for LCDCLK. 0 = the clock source for the LCD block is CCLK. 1 = the
                                clock source for the LCD block is LCD_CLKIN (external clock input
                                for the LVD).</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ACB</name>
                            <description>AC bias pin frequency. The AC bias pin frequency is only
                                applicable to STN displays. These require the pixel voltage polarity
                                to periodically reverse to prevent damage caused by DC charge
                                accumulation. Program this field with the required value minus one
                                to apply the number of line clocks between each toggle of the AC
                                bias pin, LCD_ENAB_M. This field has no effect if the LCD is
                                operating in TFT mode, when the LCD_ENAB_M pin is used as a data
                                enable signal.</description>
                            <bitRange>[10:6]</bitRange>
                        </field>
                        <field>
                            <name>IVS</name>
                            <description>Invert vertical synchronization. The IVS bit inverts the
                                polarity of the LCD_FP signal. 0 = LCD_FP pin is active HIGH and
                                inactive LOW. 1 = LCD_FP pin is active LOW and inactive HIGH.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>IHS</name>
                            <description>Invert horizontal synchronization. The IHS bit inverts the
                                polarity of the LCD_LP signal. 0 = LCD_LP pin is active HIGH and
                                inactive LOW. 1 = LCD_LP pin is active LOW and inactive HIGH.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>IPC</name>
                            <description>Invert panel clock. The IPC bit selects the edge of the
                                panel clock on which pixel data is driven out onto the LCD data
                                lines. 0 = Data is driven on the LCD data lines on the rising edge
                                of LCD_DCLK. 1 = Data is driven on the LCD data lines on the falling
                                edge of LCD_DCLK.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>IOE</name>
                            <description>Invert output enable. This bit selects the active polarity
                                of the output enable signal in TFT mode. In this mode, the
                                LCD_ENAB_M pin is used as an enable that indicates to the LCD panel
                                when valid display data is available. In active display mode, data
                                is driven onto the LCD data lines at the programmed edge of LCD_DCLK
                                when LCD_ENAB_M is in its active state. 0 = LCD_ENAB_M output pin is
                                active HIGH in TFT mode. 1 = LCD_ENAB_M output pin is active LOW in
                                TFT mode.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>CPL</name>
                            <description>Clocks per line. This field specifies the number of actual
                                LCD_DCLK clocks to the LCD panel on each line. This is the number of
                                PPL divided by either 1 (for TFT), 4 or 8 (for monochrome passive),
                                2 2/3 (for color passive), minus one. This must be correctly
                                programmed in addition to the PPL bit in the LCD_TIMH register for
                                the LCD display to work correctly.</description>
                            <bitRange>[25:16]</bitRange>
                        </field>
                        <field>
                            <name>BCD</name>
                            <description>Bypass pixel clock divider. Setting this to 1 bypasses the
                                pixel clock divider logic. This is mainly used for TFT displays.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>PCD_HI</name>
                            <description>Upper five bits of panel clock divisor. See description for
                                PCD_LO, in bits [4:0] of this register.</description>
                            <bitRange>[31:27]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LE</name>
                    <description>Line End Control register</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LED</name>
                            <description>Line-end delay. Controls Line-end signal delay from the
                                rising-edge of the last panel clock, LCD_DCLK. Program with the
                                number of LCDCLK clock periods minus 1.</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:7]</bitRange>
                        </field>
                        <field>
                            <name>LEE</name>
                            <description>LCD Line end enable. 0 = LCD_LE disabled (held LOW). 1 =
                                LCD_LE signal active.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:17]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UPBASE</name>
                    <description>Upper Panel Frame Base Address register</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>LCDUPBASE</name>
                            <description>LCD upper panel base address. This is the start address of
                                the upper panel frame data in memory and is doubleword aligned.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPBASE</name>
                    <description>Lower Panel Frame Base Address register</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>LCDLPBASE</name>
                            <description>LCD lower panel base address. This is the start address of
                                the lower panel frame data in memory and is doubleword aligned.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
