itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>DMARCLR</name>
                    <description>USB DMA Request Clear</description>
                    <addressOffset>0x254</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPRCLR0</name>
                            <description>Control endpoint OUT (DMA cannot be enabled for this
                                endpoint and the EP0 bit must be 0).</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR1</name>
                            <description>Control endpoint IN (DMA cannot be enabled for this
                                endpoint and the EP1 bit must be 0).</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR2</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR3</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR4</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR5</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR6</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR7</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR8</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR9</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR10</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR11</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR12</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR13</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR14</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR15</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR16</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR17</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR18</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR19</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR20</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR21</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR22</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR23</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR24</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR25</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR26</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR27</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR28</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR29</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR30</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPRCLR31</name>
                            <description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0
                                = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
