itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>EOTINTCLR</name>
                    <description>USB End of Transfer Interrupt Clear</description>
                    <addressOffset>0x2A4</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPTXINTCLR0</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR1</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR2</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR3</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR4</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR5</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR6</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR7</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR8</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR9</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR10</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR11</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR12</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR13</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR14</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR15</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR16</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR17</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR18</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR19</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR20</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR21</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR22</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR23</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR24</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR25</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR26</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR27</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR28</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR29</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR30</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTCLR31</name>
                            <description>Clear endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
