itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>SYSERRINTSET</name>
                    <description>USB System Error Interrupt Set</description>
                    <addressOffset>0x2C0</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPERRINTSET0</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET1</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET2</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET3</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET4</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET5</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET6</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET7</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET8</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET9</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET10</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET11</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET12</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET13</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET14</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET15</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET16</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET17</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET18</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET19</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET20</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET21</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET22</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET23</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET24</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET25</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET26</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET27</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET28</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET29</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET30</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTSET31</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) System Error
                                Interrupt request. 0 = No effect. 1 = Set the EPxx System Error
                                Interrupt request in the USBSysErrIntSt register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_RX</name>
                    <description>I2C Receive</description>
                    <addressOffset>0x300</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RXDATA</name>
                            <description>Receive data.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_WO</name>
                    <description>I2C Transmit</description>
                    <alternateRegister>I2C_RX</alternateRegister>
                    <addressOffset>0x300</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>TXDATA</name>
                            <description>Transmit data.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>START</name>
                            <description>When 1, issue a START condition before transmitting this
                                byte.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>When 1, issue a STOP condition after transmitting this
                                byte.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
