itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>CRC engine </description>
            <groupName>CRC</groupName>
            <baseAddress>0x20090000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MODE</name>
                    <description>CRC mode register</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRC_POLY</name>
                            <description>Select CRC polynomial</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CRC_CCITT_POLYNOMIAL</name>
                                    <description>CRC-CCITT polynomial</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC_16_POLYNOMIAL</name>
                                    <description>CRC-16 polynomial</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC_32_POLYNOMIAL</name>
                                    <description>CRC-32 polynomial</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BIT_RVS_WR</name>
                            <description>Select bit order for CRC_WR_DATA</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_BIT_ORDER_REVERSE</name>
                                    <description>No bit order reverse for CRC_WR_DATA (per byte)</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BIT_ORDER_REVERSE_FO</name>
                                    <description>Bit order reverse for CRC_WR_DATA (per byte)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPL_WR</name>
                            <description>Select one's complement for CRC_WR_DATA</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ONES_COMPLEMENT_</name>
                                    <description>No one's complement for CRC_WR_DATA</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONES_COMPLEMENT_FOR</name>
                                    <description>One's complement for CRC_WR_DATA</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BIT_RVS_SUM</name>
                            <description>Select bit order revers for CRC_SUM</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_BIT_ORDER_REVERSE</name>
                                    <description>No bit order reverse for CRC_SUM</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BIT_ORDER_REVERSE_FO</name>
                                    <description>Bit order reverse for CRC_SUM</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPL_SUM</name>
                            <description>Select one's complement for CRC_SUM</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ONES_COMPLEMENT_</name>
                                    <description>No one's complement for CRC_SUM</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONES_COMPLEMENT_FOR</name>
                                    <description>One's complement for CRC_SUM</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>Always 0 when read</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEED</name>
                    <description>CRC seed register</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRC_SEED</name>
                            <description>A write access to this register will load CRC seed value to
                                CRC_SUM register with selected bit order and 1's complement
                                pre-processes. A write access to this register will overrule the CRC
                                calculation in progresses.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SUM</name>
                    <description>CRC checksum register</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRC_SUM</name>
                            <description>The most recent CRC sum can be read through this register
                                with selected bit order and 1's complement post-processes.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <description>CRC data register</description>
                    <addressOffset>0x008</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CRC_WR_DATA</name>
                            <description>Data written to this register will be taken to perform CRC
                                calculation with selected bit order and 1's complement pre-process.
                                Any write size 8, 16 or 32-bit are allowed and accept back-to-back
                                transactions.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
