itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIO0</name>
            <description>General Purpose I/O </description>
            <groupName>GPIO</groupName>
            <baseAddress>0x20098000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DIR</name>
                    <description>GPIO Port0 Direction control register.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PINDIR0</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR1</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR2</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR3</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR4</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR5</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR6</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR7</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR8</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR9</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR10</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR11</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR12</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR13</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR14</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR15</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR16</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR17</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR18</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR19</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR20</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR21</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR22</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR23</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR24</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR25</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR26</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR27</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR28</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR29</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR30</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>PINDIR31</name>
                            <description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx
                                controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 =
                                Controlled pin is input. 1 = Controlled pin is output.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
