itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO1</name>
            <baseAddress>0x20098020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO2</name>
            <baseAddress>0x20098040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO3</name>
            <baseAddress>0x20098060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO4</name>
            <baseAddress>0x20098080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIO0">
            <name>GPIO5</name>
            <baseAddress>0x200980A0</baseAddress>
        </peripheral>
        <peripheral>
            <name>EMC</name>
            <description> ExternalMemory Controller (EMC) </description>
            <groupName>EMC</groupName>
            <baseAddress>0X2009C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CONTROL</name>
                    <description>Controls operation of the memory controller.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>E</name>
                            <description>EMC Enable. Indicates if the EMC is enabled or disabled:</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Disabled</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Enabled
                                        (POR and warm reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>M</name>
                            <description>Address mirror. Indicates normal or reset memory map:</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>Normal memory map.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>Reset memory map. Static memory EMC_CS1 is
                                        mirrored onto EMC_CS0 and EMC_DYCS0 (POR reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>L</name>
                            <description>Low-power mode. Indicates normal, or low-power mode:</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>WARMRESET</name>
                                    <description>Normal mode (warm
                                        reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOWPOWER</name>
                                    <description>Low-power
                                        mode. Entering low-power mode reduces memory controller
                                        power consumption.
                                        Dynamic memory is refreshed as necessary. The memory
                                        controller
                                        returns to normal functional mode by clearing the low-power
                                        mode
                                        bit (L), or by POR. This bit must only be modified when the
                                        EMC
                                        is in idle state.[1]</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <description>Provides EMC status information.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x5</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>Busy. This bit is used to ensure that the memory controller
                                enters the low-power or disabled mode cleanly by determining if the
                                memory controller is busy or not.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE</name>
                                    <description>EMC
                                        is idle (warm reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>EMC
                                        is busy performing memory transactions, commands,
                                        auto-refresh cycles,
                                        or is in self-refresh mode (POR reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>S</name>
                            <description>Write buffer status.This bit enables the EMC to enter
                                low-power mode or disabled mode cleanly.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>Write buffers
                                        empty (POR reset value)</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DATA</name>
                                    <description>Write
                                        buffers contain data.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SA</name>
                            <description>Self-refresh acknowledge. This bit indicates the operating
                                mode of the EMC.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>Normal mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELFREFRESH</name>
                                    <description>Self-refresh mode (POR reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CONFIG</name>
                    <description>Configures operation of the memory controller</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EM</name>
                            <description>Endian mode. On power-on reset, the value of the endian bit
                                is 0. All data must be flushed in the EMC before switching between
                                little-endian and big-endian modes.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LITTLEENDIAN</name>
                                    <description>Little-endian
                                        mode (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BIGENDIAN</name>
                                    <description>Big-endian
                                        mode.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:1]</bitRange>
                        </field>
                        <field>
                            <name>CLKR</name>
                            <description>CCLK: CLKOUT ratio. This bit must contain 0 for proper
                                operation of the EMC.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>PORRESET</name>
                                    <description>1:1(POR reset value)</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DONOTUSE</name>
                                    <description>1:2 (this option is not available on the
                                        LPC178x/177x)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DYNAMICCONTROL</name>
                    <description>Controls dynamic memory operation.</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x006</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CE</name>
                            <description>Dynamic memory clock enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>POWERSAVE</name>
                                    <description>Clock enable of idle devices are deasserted to save
                                        power (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>All clock enables are driven HIGH continuously.[1]</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CS</name>
                            <description>Dynamic memory clock control. When clock control is LOW the
                                output clock CLKOUT is stopped when there are no SDRAM transactions.
                                The clock is also stopped during self-refresh mode.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>STOP</name>
                                    <description>CLKOUT stops when all SDRAMs are idle and during
                                        self-refresh mode.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RUN</name>
                                    <description>CLKOUT runs continuously (POR reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SR</name>
                            <description>Self-refresh request, EMCSREFREQ. By writing 1 to this bit
                                self-refresh can be entered under software control. Writing 0 to
                                this bit returns the EMC to normal mode. The self-refresh
                                acknowledge bit in the Status register must be polled to discover
                                the current operating mode of the EMC.[2]</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL_MODE_</name>
                                    <description>Normal mode.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENTER_SELF_REFRESH_M</name>
                                    <description>Enter self-refresh mode (POR reset value).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[4:3]</bitRange>
                        </field>
                        <field>
                            <name>MMC</name>
                            <description>Memory clock control.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CLKOUT_ENABLED_POR_</name>
                                    <description>CLKOUT enabled (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKOUT_DISABLED</name>
                                    <description>CLKOUT disabled.[3]</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>I</name>
                            <description>SDRAM initialization.</description>
                            <bitRange>[8:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>Issue SDRAM NORMAL operation command (POR reset
                                        value).</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE</name>
                                    <description>Issue SDRAM MODE command.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PALL</name>
                                    <description>Issue SDRAM PALL (precharge all) command.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOP</name>
                                    <description>Issue SDRAM NOP (no operation) command)</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[13:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:14]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DYNAMICREFRESH</name>
                    <description>Configures dynamic memory refresh.</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>REFRESH</name>
                            <description>Refresh timer. Indicates the multiple of 16 CCLKs between
                                SDRAM refresh cycles. 0x0 = Refresh disabled (POR reset value). 0x1
                                - 0x7FF = n x16 = 16n CCLKs between SDRAM refresh cycles. For
                                example: 0x1 = 1 x 16 = 16 CCLKs between SDRAM refresh cycles. 0x8 =
                                8 x 16 = 128 CCLKs between SDRAM refresh cycles</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:11]</bitRange>
                        </field>
                    </fields>
                </register>
