itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>DYNAMICCONFIG%s</name>
                    <description>Configuration information for EMC_DYCS0.</description>
                    <addressOffset>0x100</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>MD</name>
                            <description>Memory device.</description>
                            <bitRange>[4:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SDRAM_POR_RESET_VAL</name>
                                    <description>SDRAM (POR reset value).</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW_POWER_SDRAM_</name>
                                    <description>Low-power SDRAM.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_</name>
                                    <description>Reserved.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_</name>
                                    <description>Reserved.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[6:5]</bitRange>
                        </field>
                        <field>
                            <name>AM0</name>
                            <description>See Table 133. 000000 = reset value.[1]</description>
                            <bitRange>[12:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>AM1</name>
                            <description>See Table 133. 0 = reset value.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[18:15]</bitRange>
                        </field>
                        <field>
                            <name>B</name>
                            <description>Buffer enable.</description>
                            <bitRange>[19:19]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUFFER_DISABLED_FOR_</name>
                                    <description>Buffer disabled for accesses to this chip select
                                        (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUFFER_ENABLED_FOR_A</name>
                                    <description>Buffer enabled for accesses to this chip select.[2]</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P</name>
                            <description>Write protect.</description>
                            <bitRange>[20:20]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>WRITES_NOT_PROTECTED</name>
                                    <description>Writes not protected (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITES_PROTECTED_</name>
                                    <description>Writes protected.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:21]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>DYNAMICRASCAS%s</name>
                    <description>RAS and CAS latencies for EMC_DYCS0.</description>
                    <addressOffset>0x104</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x303</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RAS</name>
                            <description>RAS latency (active to read/write delay).</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>RESERVED_</name>
                                    <description>Reserved.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONE_CCLK_CYCLE_</name>
                                    <description>One CCLK cycle.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TWO_CCLK_CYCLES_</name>
                                    <description>Two CCLK cycles.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THREE_CCLK_CYCLES_P</name>
                                    <description>Three CCLK cycles (POR reset value).</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>CAS</name>
                            <description>CAS latency.</description>
                            <bitRange>[9:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>RESERVED_</name>
                                    <description>Reserved.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONE_CCLK_CYCLE_</name>
                                    <description>One CCLK cycle.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TWO_CCLK_CYCLES_</name>
                                    <description>Two CCLK cycles.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THREE_CCLK_CYCLES_P</name>
                                    <description>Three CCLK cycles (POR reset value).</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICCONFIG%s</name>
                    <description>Configuration for EMC_CS0.</description>
                    <addressOffset>0x200</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MW</name>
                            <description>Memory width.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>8_BIT_POR_RESET_VAL</name>
                                    <description>8 bit (POR reset value).</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_BIT_</name>
                                    <description>16 bit.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32_BIT_</name>
                                    <description>32 bit.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED_</name>
                                    <description>Reserved.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>Page mode. In page mode the EMC can burst up to four
                                external accesses. Therefore devices with asynchronous page mode
                                burst four or higher devices are supported. Asynchronous page mode
                                burst two devices are not supported and must be accessed normally.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED_POR_RESET_</name>
                                    <description>Disabled (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ASYNCHRONOUS_PAGE_MO</name>
                                    <description>Asynchronous page mode enabled (page length four).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>PC</name>
                            <description>Chip select polarity. The value of the chip select polarity
                                on power-on reset is 0.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ACTIVE_LOW_CHIP_SELE</name>
                                    <description>Active LOW chip select.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_HIGH_CHIP_SEL</name>
                                    <description>Active HIGH chip select.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>Byte lane state. The byte lane state bit, PB, enables
                                different types of memory to be connected. For byte-wide static
                                memories the BLS3:0 signal from the EMC is usually connected to WE
                                (write enable). In this case for reads all the BLS3:0 bits must be
                                HIGH. This means that the byte lane state (PB) bit must be LOW. 16
                                bit wide static memory devices usually have the BLS3:0 signals
                                connected to the UBn and LBn (upper byte and lower byte) signals in
                                the static memory. In this case a write to a particular byte must
                                assert the appropriate UBn or LBn signal LOW. For reads, all the UB
                                and LB signals must be asserted LOW so that the bus is driven. In
                                this case the byte lane state (PB) bit must be HIGH.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BLSHIGH</name>
                                    <description>For reads all the bits in BLS3:0 are HIGH. For
                                        writes the respective active bits in BLS3:0 are LOW (POR
                                        reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BLSLOW</name>
                                    <description>For reads the respective active bits in BLS3:0 are
                                        LOW. For writes the respective active bits in BLS3:0 are
                                        LOW.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EW</name>
                            <description>Extended wait (EW) uses the EMCStaticExtendedWait register
                                to time both the read and write transfers rather than the
                                EMCStaticWaitRd and EMCStaticWaitWr registers. This enables much
                                longer transactions. [1]</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>EXTENDED_WAIT_DISABL</name>
                                    <description>Extended wait disabled (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EXTENDED_WAIT_ENABLE</name>
                                    <description>Extended wait enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[18:9]</bitRange>
                        </field>
                        <field>
                            <name>B</name>
                            <description>Buffer enable [2]</description>
                            <bitRange>[19:19]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUFFER_DISABLED_POR</name>
                                    <description>Buffer disabled (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUFFER_ENABLED_</name>
                                    <description>Buffer enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>P</name>
                            <description>Write protect</description>
                            <bitRange>[20:20]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>WRITES_NOT_PROTECTED</name>
                                    <description>Writes not protected (POR reset value).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITE_PROTECTED_</name>
                                    <description>Write protected.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:21]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITWEN%s</name>
                    <description>Delay from EMC_CS0 to write enable.</description>
                    <addressOffset>0x204</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITWEN</name>
                            <description>Wait write enable. Delay from chip select assertion to
                                write enable. 0x0 = One CCLK cycle delay between assertion of chip
                                select and write enable (POR reset value). 0x1 - 0xF = (n + 1) CCLK
                                cycle delay. The delay is (WAITWEN +1) x tCCLK.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
