itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITOEN%s</name>
                    <description>Delay from EMC_CS0 or address change, whichever is later, to output
                        enable.</description>
                    <addressOffset>0x208</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITOEN</name>
                            <description>Wait output enable. Delay from chip select assertion to
                                output enable. 0x0 = No delay (POR reset value). 0x1 - 0xF = n cycle
                                delay. The delay is WAITOEN x tCCLK.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITRD%s</name>
                    <description>Delay from EMC_CS0 to a read access.</description>
                    <addressOffset>0x20C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITRD</name>
                            <description>Non-page mode read wait states or asynchronous page mode
                                read first access wait state. Non-page mode read or asynchronous
                                page mode read, first read only: 0x0 - 0x1E = (n + 1) CCLK cycles
                                for read accesses. For non-sequential reads, the wait state time is
                                (WAITRD + 1) x tCCLK. 0x1F = 32 CCLK cycles for read accesses (POR
                                reset value).</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITPAGE%s</name>
                    <description>Delay for asynchronous page mode sequential accesses for EMC_CS0.</description>
                    <addressOffset>0x210</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITPAGE</name>
                            <description>Asynchronous page mode read after the first read wait
                                states. Number of wait states for asynchronous page mode read
                                accesses after the first read: 0x0 - 0x1E = (n+ 1) CCLK cycle read
                                access time. For asynchronous page mode read for sequential reads,
                                the wait state time for page mode accesses after the first read is
                                (WAITPAGE + 1) x tCCLK. 0x1F = 32 CCLK cycle read access time (POR
                                reset value).</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITWR%s</name>
                    <description>Delay from EMC_CS0 to a write access.</description>
                    <addressOffset>0x214</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITWR</name>
                            <description>Write wait states. SRAM wait state time for write accesses
                                after the first read: 0x0 - 0x1E = (n + 2) CCLK cycle write access
                                time. The wait state time for write accesses after the first read is
                                WAITWR (n + 2) x tCCLK. 0x1F = 33 CCLK cycle write access time (POR
                                reset value).</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x20</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>STATICWAITTURN%s</name>
                    <description>Number of bus turnaround cycles EMC_CS0.</description>
                    <addressOffset>0x218</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WAITTURN</name>
                            <description>Bus turn-around cycles. 0x0 - 0xE = (n + 1) CCLK
                                turn-around cycles. Bus turn-around time is (WAITTURN + 1) x tCCLK.
                                0xF = 16 CCLK turn-around cycles (POR reset value).</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
