itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WWDT</name>
            <description>Windowed Watchdog Timer (WWDT) </description>
            <groupName>WWDT</groupName>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDT</name>
                <value>0</value>
            </interrupt>
            <registers>
                <register>
                    <name>MOD</name>
                    <description>Watchdog mode register. This register determines the basic mode and
                        status of the Watchdog Timer.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WDEN</name>
                            <description>Watchdog enable bit. This bit is Set Only. See Table 652.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>STOP</name>
                                    <description>The watchdog timer is stopped.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RUN</name>
                                    <description>The watchdog timer is running.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WDRESET</name>
                            <description>Watchdog reset enable bit. This bit is Set Only. See Table
                                652.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORESET</name>
                                    <description>A watchdog timeout will not cause a chip reset.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESET</name>
                                    <description>A watchdog timeout will cause a chip reset.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTOF</name>
                            <description>Watchdog time-out flag. Set when the watchdog timer times
                                out, by a feed error, or by events associated with WDPROTECT,
                                cleared by software. Causes a chip reset if WDRESET = 1. See Section
                                WDTOF.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>WDINT</name>
                            <description>Watchdog interrupt flag. Set when the timer reaches the
                                value in WDWARNINT. Cleared by software. See Section WDINT.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>WDPROTECT</name>
                            <description>Watchdog update mode. This bit is Set Only. See Section
                                WDPROTECT.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CHANGE</name>
                                    <description>The watchdog reload value (WDTC) can be changed at
                                        any time.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CHANGE_W_CNT</name>
                                    <description>The watchdog reload value (WDTC) can be changed
                                        only after the counter is below the value of WDWARNINT and
                                        WDWINDOW. Note: this mode is intended for use only when
                                        WDRESET =1.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TC</name>
                    <description>Watchdog timer constant register. The value in this register
                        determines the time-out value.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Count</name>
                            <description>Watchdog time-out interval.</description>
                            <bitRange>[23:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FEED</name>
                    <description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to
                        this register reloads the Watchdog timer with the value contained in WDTC.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>Feed</name>
                            <description>Feed value should be 0xAA followed by 0x55.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TV</name>
                    <description>Watchdog timer value register. This register reads out the current
                        value of the Watchdog timer.</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Count</name>
                            <description>Counter timer value.</description>
                            <bitRange>[23:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WARNINT</name>
                    <description>Watchdog Warning Interrupt compare value.</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WARNINT</name>
                            <description>Watchdog warning interrupt compare value.</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WINDOW</name>
                    <description>Watchdog Window compare value.</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WINDOW</name>
                            <description>Watchdog window value.</description>
                            <bitRange>[23:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
