itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>CTCR</name>
                    <description>Count Control Register. The CTCR selects between Timer and Counter
                        mode, and in Counter mode selects the signal and edge(s) for counting.</description>
                    <addressOffset>0x070</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTMODE</name>
                            <description>Counter/Timer Mode This field selects which rising PCLK
                                edges can increment Timer's Prescale Counter (PC), or clear PC and
                                increment Timer Counter (TC). Timer Mode: the TC is incremented when
                                the Prescale Counter matches the Prescale Register.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>TIMER_MODE_EVERY_RI</name>
                                    <description>Timer Mode: every rising PCLK edge</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RISING</name>
                                    <description>Counter Mode: TC is incremented on rising edges on
                                        the CAP input selected by bits 3:2.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FALLING</name>
                                    <description>Counter Mode: TC is incremented on falling edges on
                                        the CAP input selected by bits 3:2.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DUALEDGE</name>
                                    <description>Counter Mode: TC is incremented on both edges on
                                        the CAP input selected by bits 3:2.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>Count Input Select When bits 1:0 in this register are not
                                00, these bits select which CAP pin is sampled for clocking. Note:
                                If Counter mode is selected for a particular CAPn input in the
                                TnCTCR, the 3 bits for that input in the Capture Control Register
                                (TnCCR) must be programmed as 000. However, capture and/or interrupt
                                can be selected for the other 3 CAPn inputs in the same timer.</description>
                            <bitRange>[3:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CAPN_0_FOR_TIMERN</name>
                                    <description>CAPn.0 for TIMERn</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CAPN_1_FOR_TIMERN</name>
                                    <description>CAPn.1 for TIMERn</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED</name>
                                    <description>Reserved</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESERVED</name>
                                    <description>Reserved</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIMER0">
            <name>TIMER1</name>
            <baseAddress>0x40008000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIMER1</name>
                <value>2</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>UART0</name>
            <description>UART0/2/3 </description>
            <groupName>UART0</groupName>
            <baseAddress>0x4000C000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART0</name>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>RBR</name>
                    <description>Receiver Buffer Register. Contains the next received character to
                        be read (DLAB =0).</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RBR</name>
                            <description>The UARTn Receiver Buffer Register contains the oldest
                                received byte in the UARTn Rx FIFO.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>THR</name>
                    <description>Transmit Holding Regiter. The next character to be transmitted is
                        written here (DLAB =0).</description>
                    <alternateRegister>RBR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>THR</name>
                            <description>Writing to the UARTn Transmit Holding Register causes the
                                data to be stored in the UARTn transmit FIFO. The byte will be sent
                                when it reaches the bottom of the FIFO and the transmitter is
                                available.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLL</name>
                    <description>Divisor Latch LSB. Least significant byte of the baud rate divisor
                        value. The full divisor is used to generate a baud rate from the fractional
                        rate divider (DLAB =1).</description>
                    <alternateRegister>RBR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLLSB</name>
                            <description>The UARTn Divisor Latch LSB Register, along with the UnDLM
                                register, determines the baud rate of the UARTn.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLM</name>
                    <description>Divisor Latch MSB. Most significant byte of the baud rate divisor
                        value. The full divisor is used to generate a baud rate from the fractional
                        rate divider (DLAB =1).</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLMSB</name>
                            <description>The UARTn Divisor Latch MSB Register, along with the U0DLL
                                register, determines the baud rate of the UARTn.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IER</name>
                    <description>Interrupt Enable Register. Contains individual interrupt enable
                        bits for the 7 potential UART interrupts (DLAB =0).</description>
                    <alternateRegister>DLM</alternateRegister>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBRIE</name>
                            <description>RBR Interrupt Enable. Enables the Receive Data Available
                                interrupt for UARTn. It also controls the Character Receive Time-out
                                interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_RDA_INTE</name>
                                    <description>Disable the RDA interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_RDA_INTER</name>
                                    <description>Enable the RDA interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THREIE</name>
                            <description>THRE Interrupt Enable. Enables the THRE interrupt for
                                UARTn. The status of this can be read from UnLSR[5].</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_THRE_INT</name>
                                    <description>Disable the THRE interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_THRE_INTE</name>
                                    <description>Enable the THRE interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXIE</name>
                            <description>RX Line Status Interrupt Enable. Enables the UARTn RX line
                                status interrupts. The status of this interrupt can be read from
                                UnLSR[4:1].</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_THE_RX_LINE_</name>
                                    <description>Disable the RX line status interrupts.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_THE_RX_LINE_S</name>
                                    <description>Enable the RX line status interrupts.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:3]</bitRange>
                        </field>
                        <field>
                            <name>ABEOINTEN</name>
                            <description>Enables the end of auto-baud interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_END_OF_AUTO_</name>
                                    <description>Disable end of auto-baud Interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_END_OF_AUTO_B</name>
                                    <description>Enable end of auto-baud Interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABTOINTEN</name>
                            <description>Enables the auto-baud time-out interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_AUTO_BAUD_TI</name>
                                    <description>Disable auto-baud time-out Interrupt.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_AUTO_BAUD_TIM</name>
                                    <description>Enable auto-baud time-out Interrupt.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIR</name>
                    <description>Interrupt ID Register. Identifies which interrupt(s) are pending.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INTSTATUS</name>
                            <description>Interrupt status. Note that UnIIR[0] is active low. The
                                pending interrupt can be determined by evaluating UnIIR[3:1].</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>AT_LEAST_ONE_INTERRU</name>
                                    <description>At least one interrupt is pending.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_INTERRUPT_IS_PEND</name>
                                    <description>No interrupt is pending.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INTID</name>
                            <description>Interrupt identification. UnIER[3:1] identifies an
                                interrupt corresponding to the UARTn Rx or TX FIFO. All other
                                combinations of UnIER[3:1] not listed below are reserved
                                (000,100,101,111).</description>
                            <bitRange>[3:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>1_RECEIVE_LINE_S</name>
                                    <description>1 - Receive Line Status (RLS).</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2A__RECEIVE_DATA_AV</name>
                                    <description>2a - Receive Data Available (RDA).</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2B__CHARACTER_TIME_</name>
                                    <description>2b - Character Time-out Indicator (CTI).</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>3_THRE_INTERRUPT</name>
                                    <description>3 - THRE Interrupt</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>FIFOENABLE</name>
                            <description>Copies of UnFCR[0].</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                        <field>
                            <name>ABEOINT</name>
                            <description>End of auto-baud interrupt. True if auto-baud has finished
                                successfully and interrupt is enabled.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>ABTOINT</name>
                            <description>Auto-baud time-out interrupt. True if auto-baud has timed
                                out and interrupt is enabled.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
