itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PWM0</name>
            <description>Pulse Width Modulators (PWM0/1) </description>
            <groupName>PWM</groupName>
            <baseAddress>0x40014000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PWM0</name>
                <value>39</value>
            </interrupt>
            <registers>
                <register>
                    <name>IR</name>
                    <description>Interrupt Register. The IR can be written to clear interrupts, or
                        read to identify which PWM interrupt sources are pending.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PWMMR0INT</name>
                            <description>Interrupt flag for PWM match channel 0.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR1INT</name>
                            <description>Interrupt flag for PWM match channel 1.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR2INT</name>
                            <description>Interrupt flag for PWM match channel 2.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR3INT</name>
                            <description>Interrupt flag for PWM match channel 3.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>PWMCAP0INT</name>
                            <description>Interrupt flag for capture input 0</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PWMCAP1INT</name>
                            <description>Interrupt flag for capture input 1 (available in PWM1IR
                                only; this bit is reserved in PWM0IR).</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR4INT</name>
                            <description>Interrupt flag for PWM match channel 4.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR5INT</name>
                            <description>Interrupt flag for PWM match channel 5.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PWMMR6INT</name>
                            <description>Interrupt flag for PWM match channel 6.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCR</name>
                    <description>Timer Control Register. The TCR is used to control the Timer
                        Counter functions.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CE</name>
                            <description>Counter Enable</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_PWM_TIMER_COUNTE</name>
                                    <description>The PWM Timer Counter and PWM Prescale Counter are
                                        enabled for counting.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_COUNTERS_ARE_DIS</name>
                                    <description>The counters are disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CR</name>
                            <description>Counter Reset</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_PWM_TIMER_COUNTE</name>
                                    <description>The PWM Timer Counter and the PWM Prescale Counter
                                        are synchronously reset on the next positive edge of PCLK.
                                        The counters remain reset until this bit is returned to
                                        zero.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLEAR_RESET_</name>
                                    <description>Clear reset.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PWMEN</name>
                            <description>PWM Enable</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>PWM_MODE_IS_ENABLED_</name>
                                    <description>PWM mode is enabled (counter resets to 1). PWM mode
                                        causes the shadow registers to operate in connection with
                                        the Match registers. A program write to a Match register
                                        will not have an effect on the Match result until the
                                        corresponding bit in PWMLER has been set, followed by the
                                        occurrence of a PWM Match 0 event. Note that the PWM Match
                                        register that determines the PWM rate (PWM Match Register 0
                                        - MR0) must be set up prior to the PWM being enabled.
                                        Otherwise a Match event will not occur to cause shadow
                                        register contents to become effective.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TIMER_MODE_IS_ENABLE</name>
                                    <description>Timer mode is enabled (counter resets to 0).</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MDIS</name>
                            <description>Master Disable (PWM0 only). The two PWMs may be
                                synchronized using the Master Disable control bit. The Master
                                disable bit of the Master PWM (PWM0 module) controls a secondary
                                enable input to both PWMs, as shown in Figure 141. This bit has no
                                function in the Slave PWM (PWM1).</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>MASTER_USE_PWM0_IS_</name>
                                    <description>Master use. PWM0 is the master, and both PWMs are
                                        enabled for counting.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INDIVIDUAL_USE_THE_</name>
                                    <description>Individual use. The PWMs are used independently,
                                        and the individual Counter Enable bits are used to control
                                        the PWMs.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TC</name>
                    <description>Timer Counter. The 32 bit TC is incremented every PR+1 cycles of
                        PCLK. The TC is controlled through the TCR.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TC</name>
                            <description>Timer counter value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <description>Prescale Register. Determines how often the PWM counter is
                        incremented.</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PM</name>
                            <description>Prescale counter maximum value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PC</name>
                    <description>Prescale Counter. Prescaler for the main PWM counter.</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PC</name>
                            <description>Prescale counter value.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
