itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>DOW</name>
                    <description>Day of Week Register</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DOW</name>
                            <description>Day of week value in the range of 0 to 6.</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOY</name>
                    <description>Day of Year Register</description>
                    <addressOffset>0x034</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DOY</name>
                            <description>Day of year value in the range of 1 to 365 (366 for leap
                                years).</description>
                            <bitRange>[8:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MONTH</name>
                    <description>Months Register</description>
                    <addressOffset>0x038</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MONTH</name>
                            <description>Month value in the range of 1 to 12.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>YEAR</name>
                    <description>Years Register</description>
                    <addressOffset>0x03C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>YEAR</name>
                            <description>Year value in the range of 0 to 4095.</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CALIBRATION</name>
                    <description>Calibration Value Register</description>
                    <addressOffset>0x040</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CALVAL</name>
                            <description>If enabled, the calibration counter counts up to this
                                value. The maximum value is 131, 072 corresponding to about 36.4
                                hours. Calibration is disabled if CALVAL = 0.</description>
                            <bitRange>[16:0]</bitRange>
                        </field>
                        <field>
                            <name>CALDIR</name>
                            <description>Calibration direction</description>
                            <bitRange>[17:17]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BACKWARD_CALIBRATION</name>
                                    <description>Backward calibration. When CALVAL is equal to the
                                        calibration counter, the RTC timers will stop incrementing
                                        for 1 second.</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FORWARD_CALIBRATION_</name>
                                    <description>Forward calibration. When CALVAL is equal to the
                                        calibration counter, the RTC timers will jump by 2 seconds.</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-4</dimIndex>
                    <name>GPREG%s</name>
                    <description>General Purpose Register 0</description>
                    <addressOffset>0x044</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>GP</name>
                            <description>General purpose storage.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_AUX</name>
                    <description>RTC Auxiliary control register</description>
                    <addressOffset>0x05C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RTC_OSCF</name>
                            <description>RTC Oscillator Fail detect flag. Read: this bit is set if
                                the RTC oscillator stops, and when RTC power is first turned on. An
                                interrupt will occur when this bit is set, the RTC_OSCFEN bit in
                                RTC_AUXEN is a 1, and the RTC interrupt is enabled in the NVIC.
                                Write: writing a 1 to this bit clears the flag.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RTC_PDOUT</name>
                            <description>When 0: the RTC_ALARM pin reflects the RTC alarm status.
                                When 1: the RTC_ALARM pin indicates Deep Power-down mode.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_AUXEN</name>
                    <description>RTC Auxiliary Enable register</description>
                    <addressOffset>0x058</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RTC_OSCFEN</name>
                            <description>Oscillator Fail Detect interrupt enable. When 0: the RTC
                                Oscillator Fail detect interrupt is disabled. When 1: the RTC
                                Oscillator Fail detect interrupt is enabled. See Section 30.6.2.5.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ASEC</name>
                    <description>Alarm value for Seconds</description>
                    <addressOffset>0x060</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>SECONDS</name>
                            <description>Seconds value in the range of 0 to 59</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMIN</name>
                    <description>Alarm value for Minutes</description>
                    <addressOffset>0x64</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MINUTES</name>
                            <description>Minutes value in the range of 0 to 59</description>
                            <bitRange>[5:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHRS</name>
                    <description>Alarm value for Hours</description>
                    <addressOffset>0x068</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>HOURS</name>
                            <description>Hours value in the range of 0 to 23</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADOM</name>
                    <description>Alarm value for Day of Month</description>
                    <addressOffset>0x06C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DOM</name>
                            <description>Day of month value in the range of 1 to 28, 29, 30, or 31
                                (depending on the month and whether it is a leap year).</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADOW</name>
                    <description>Alarm value for Day of Week</description>
                    <addressOffset>0x070</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DOW</name>
                            <description>Day of week value in the range of 0 to 6.</description>
                            <bitRange>[2:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADOY</name>
                    <description>Alarm value for Day of Year</description>
                    <addressOffset>0x074</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>DOY</name>
                            <description>Day of year value in the range of 1 to 365 (366 for leap
                                years).</description>
                            <bitRange>[8:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMON</name>
                    <description>Alarm value for Months</description>
                    <addressOffset>0x078</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MONTH</name>
                            <description>Month value in the range of 1 to 12.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AYRS</name>
                    <description>Alarm value for Year</description>
                    <addressOffset>0x07C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>YEAR</name>
                            <description>Year value in the range of 0 to 4095.</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
