itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>ERCONTROL</name>
                    <description>Event Monitor/Recorder Control register. Contains bits that control
                        actions for the event channels as well as for Event Monitor/Recorder setup.</description>
                    <addressOffset>0x084</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INTWAKE_EN0</name>
                            <description>Interrupt and wakeup enable for channel 0.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_INTERRUPT_OR_WAKE</name>
                                    <description>No interrupt or wakeup will be generated by event
                                        channel 0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AN_EVENT_IN_CHANNEL_</name>
                                    <description>An event in channel 0 will trigger an (RTC)
                                        interrupt and a wake-up request.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPCLEAR_EN0</name>
                            <description>Enables automatically clearing the RTC general purpose
                                registers when an event occurs on channel 0.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOGPREG</name>
                                    <description>Channel 0 has no influence on the general purpose
                                        registers.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLRGPREG</name>
                                    <description>An event in channel 0 will clear the general
                                        purpose registers asynchronously.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POL0</name>
                            <description>Selects the polarity of an event on input pin RTC_EV0.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>A channel 0 event is defined as a negative edge on
                                        RTC_EV0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>A channel 0 event is defined as a positive edge on
                                        RTC_EV0.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EV0_INPUT_EN</name>
                            <description>Event enable control for channel 0.[1]</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Event 0 input is disabled and forced high
                                        internally.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Event 0 input is enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[9:4]</bitRange>
                        </field>
                        <field>
                            <name>INTWAKE_EN1</name>
                            <description>Interrupt and wakeup enable for channel 1.</description>
                            <bitRange>[10:10]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_INTERRUPT_OR_WAKE</name>
                                    <description>No interrupt or wakeup will be generated by event
                                        channel 1.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WAKEUP</name>
                                    <description>An event in channel 1 will trigger an (RTC)
                                        interrupt and a wake-up request.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPCLEAR_EN1</name>
                            <description>Enables automatically clearing the RTC general purpose
                                registers when an event occurs on channel 1.</description>
                            <bitRange>[11:11]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOGPREG</name>
                                    <description>Channel 1 has no influence on the general purpose
                                        registers.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLRGPREG</name>
                                    <description>A n event in channel 1 will clear the general
                                        purpose registers asynchronously.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POL1</name>
                            <description>Selects the polarity of an event on input pin RTC_EV1.</description>
                            <bitRange>[12:12]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>A channel 1 event is defined as a negative edge on
                                        RTC_EV1.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>A channel 1 event is defined as a positive edge on
                                        RTC_EV1.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EV1_INPUT_EN</name>
                            <description>Event enable control for channel 1.[1]</description>
                            <bitRange>[13:13]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Event 1 input is disabled and forced high
                                        internally.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Event 1 input is enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[19:14]</bitRange>
                        </field>
                        <field>
                            <name>INTWAKE_EN2</name>
                            <description>Interrupt and wakeup enable for channel 2.</description>
                            <bitRange>[20:20]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_INTERRUPT_OR_WAKE</name>
                                    <description>No interrupt or wakeup will be generated by event
                                        channel 2.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WAKEUP</name>
                                    <description>An event in channel 2 will trigger an (RTC)
                                        interrupt and a wake-up request.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPCLEAR_EN2</name>
                            <description>Enables automatically clearing the RTC general purpose
                                registers when an event occurs on channel 2.</description>
                            <bitRange>[21:21]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOGPREG</name>
                                    <description>Channel 2 has no influence on the general purpose
                                        registers.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLRGPREG</name>
                                    <description>An event in channel 2 will clear the general
                                        purpose registers asynchronously.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POL2</name>
                            <description>Selects the polarity of an event on input pin RTC_EV2.</description>
                            <bitRange>[22:22]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>A channel 2 event is defined as a negative edge on
                                        RTC_EV2.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>A channel 2 event is defined as a positive edge on
                                        RTC_EV2.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EV2_INPUT_EN</name>
                            <description>Event enable control for channel 2.[1]</description>
                            <bitRange>[23:23]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Event 2 input is disabled and forced high
                                        internally.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Event 2 input is enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[29:24]</bitRange>
                        </field>
                        <field>
                            <name>ERMODE</name>
                            <description>Controls enabling the Event Monitor/Recorder and selecting
                                its operating frequency.[2]</description>
                            <bitRange>[31:30]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Event Monitor/Recorder clocks are disabled.
                                        Operation of the Event Monitor/Recorder is disabled except
                                        for asynchronous clearing of GP registers if selected.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_EVENT_MONITOR16HZ</name>
                                    <description>Enable Event Monitor/Recorder and select a 16 Hz
                                        sample clock for event input edge detection and glitch
                                        suppression. Pulses (in either direction) shorter than 62.5
                                        ms to 125 ms will be filtered out.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_EVENT_MONITOR64HZ</name>
                                    <description>Enable Event Monitor/Recorder and select a 64 Hz
                                        sample clock for event input edge detection and glitch
                                        suppression. Pulses (in either direction) shorter than 15.6
                                        ms to 31.2 ms will be filtered out.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_EVENT_MONITOR1KHZ</name>
                                    <description>Enable Event Monitor/Recorder and select a 1 kHz
                                        sample clock for event input edge detection and glitch
                                        suppression. Pulses (in either direction) shorter than 1 ms
                                        to 2 ms will be filtered out.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
