itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>STATF2</name>
                    <description>GPIO Interrupt Status for Falling edge for Port 0.</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>P2_0FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[0]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>P2_1FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[1]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>P2_2FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[2]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>P2_3FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[3]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>P2_4FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[4]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>P2_5FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[5]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>P2_6FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[6]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>P2_7FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[7]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>P2_8FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[8]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>P2_9FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[9]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>P2_10FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[10]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>P2_11FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[11]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>P2_12FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[12]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>P2_13FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[13]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>P2_14FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[14]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>P2_15FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[15]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>P2_16FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[16]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>P2_17FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[17]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>P2_18FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[18]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>P2_19FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[19]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>P2_20FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[20]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>P2_21FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[21]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>P2_22FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[22]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>P2_23FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[23]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>P2_24FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[24]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>P2_25FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[25]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>P2_26FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[26]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>P2_27FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[27]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>P2_28FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[28]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>P2_29FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[29]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>P2_30FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[30]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>P2_31FEI</name>
                            <description>Status of Falling Edge Interrupt for P2[31]. 0 = No falling
                                edge detected. 1 = Falling edge interrupt generated.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
