itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>CLR2</name>
                    <description>GPIO Interrupt Clear.</description>
                    <addressOffset>0x02C</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>P2_0CI</name>
                            <description>Clear GPIO port Interrupts for P2[0]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>P2_1CI</name>
                            <description>Clear GPIO port Interrupts for P2[1]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>P2_2CI</name>
                            <description>Clear GPIO port Interrupts for P2[2]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>P2_3CI</name>
                            <description>Clear GPIO port Interrupts for P2[3]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>P2_4CI</name>
                            <description>Clear GPIO port Interrupts for P2[4]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>P2_5CI</name>
                            <description>Clear GPIO port Interrupts for P2[5]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>P2_6CI</name>
                            <description>Clear GPIO port Interrupts for P2[6]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>P2_7CI</name>
                            <description>Clear GPIO port Interrupts for P2[7]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>P2_8CI</name>
                            <description>Clear GPIO port Interrupts for P2[8]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>P2_9CI</name>
                            <description>Clear GPIO port Interrupts for P2[9]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>P2_10CI</name>
                            <description>Clear GPIO port Interrupts for P2[10]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>P2_11CI</name>
                            <description>Clear GPIO port Interrupts for P2[11]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>P2_12CI</name>
                            <description>Clear GPIO port Interrupts for P2[12]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>P2_13CI</name>
                            <description>Clear GPIO port Interrupts for P2[13]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>P2_14CI</name>
                            <description>Clear GPIO port Interrupts for P2[14]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>P2_15CI</name>
                            <description>Clear GPIO port Interrupts for P2[15]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>P2_16CI</name>
                            <description>Clear GPIO port Interrupts for P2[16]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>P2_17CI</name>
                            <description>Clear GPIO port Interrupts for P2[17]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>P2_18CI</name>
                            <description>Clear GPIO port Interrupts for P2[18]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>P2_19CI</name>
                            <description>Clear GPIO port Interrupts for P2[19]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>P2_20CI</name>
                            <description>Clear GPIO port Interrupts for P2[20]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>P2_21CI</name>
                            <description>Clear GPIO port Interrupts for P2[21]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>P2_22CI</name>
                            <description>Clear GPIO port Interrupts for P2[22]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>P2_23CI</name>
                            <description>Clear GPIO port Interrupts for P2[23]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>P2_24CI</name>
                            <description>Clear GPIO port Interrupts for P2[24]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>P2_25CI</name>
                            <description>Clear GPIO port Interrupts for P2[25]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>P2_26CI</name>
                            <description>Clear GPIO port Interrupts for P2[26]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>P2_27CI</name>
                            <description>Clear GPIO port Interrupts for P2[27]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>P2_28CI</name>
                            <description>Clear GPIO port Interrupts for P2[28]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>P2_29CI</name>
                            <description>Clear GPIO port Interrupts for P2[29]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>P2_30CI</name>
                            <description>Clear GPIO port Interrupts for P2[30]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>P2_31CI</name>
                            <description>Clear GPIO port Interrupts for P2[31]. 0 = No effect. 1 =
                                Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
