itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>ENR2</name>
                    <description>GPIO Interrupt Enable for Rising edge for Port 0.</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>P2_0ER</name>
                            <description>Enable rising edge interrupt for P2[0]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>P2_1ER</name>
                            <description>Enable rising edge interrupt for P2[1]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>P2_2ER</name>
                            <description>Enable rising edge interrupt for P2[2]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>P2_3ER</name>
                            <description>Enable rising edge interrupt for P2[3]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>P2_4ER</name>
                            <description>Enable rising edge interrupt for P2[4]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>P2_5ER</name>
                            <description>Enable rising edge interrupt for P2[5]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>P2_6ER</name>
                            <description>Enable rising edge interrupt for P2[6]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>P2_7ER</name>
                            <description>Enable rising edge interrupt for P2[7]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>P2_8ER</name>
                            <description>Enable rising edge interrupt for P2[8]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>P2_9ER</name>
                            <description>Enable rising edge interrupt for P2[9]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>P2_10ER</name>
                            <description>Enable rising edge interrupt for P2[10]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>P2_11ER</name>
                            <description>Enable rising edge interrupt for P2[11]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>P2_12ER</name>
                            <description>Enable rising edge interrupt for P2[12]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>P2_13ER</name>
                            <description>Enable rising edge interrupt for P2[13]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>P2_14ER</name>
                            <description>Enable rising edge interrupt for P2[14]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>P2_15ER</name>
                            <description>Enable rising edge interrupt for P2[15]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>P2_16ER</name>
                            <description>Enable rising edge interrupt for P2[16]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>P2_17ER</name>
                            <description>Enable rising edge interrupt for P2[17]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>P2_18ER</name>
                            <description>Enable rising edge interrupt for P2[18]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>P2_19ER</name>
                            <description>Enable rising edge interrupt for P2[19]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>P2_20ER</name>
                            <description>Enable rising edge interrupt for P2[20]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>P2_21ER</name>
                            <description>Enable rising edge interrupt for P2[21]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>P2_22ER</name>
                            <description>Enable rising edge interrupt for P2[22]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>P2_23ER</name>
                            <description>Enable rising edge interrupt for P2[23]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>P2_24ER</name>
                            <description>Enable rising edge interrupt for P2[24]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>P2_25ER</name>
                            <description>Enable rising edge interrupt for P2[25]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>P2_26ER</name>
                            <description>Enable rising edge interrupt for P2[26]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>P2_27ER</name>
                            <description>Enable rising edge interrupt for P2[27]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>P2_28ER</name>
                            <description>Enable rising edge interrupt for P2[28]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>P2_29ER</name>
                            <description>Enable rising edge interrupt for P2[29]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>P2_30ER</name>
                            <description>Enable rising edge interrupt for P2[30]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>P2_31ER</name>
                            <description>Enable rising edge interrupt for P2[31]. 0 = Disable rising
                                edge interrupt. 1 = Enable rising edge interrupt.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
