itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CAN1</name>
            <description>CAN1 controller </description>
            <groupName>CAN</groupName>
            <baseAddress>0x40044000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CAN</name>
                <value>25</value>
            </interrupt>
            <registers>
                <register>
                    <name>MOD</name>
                    <description>Controls the operating mode of the CAN Controller.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>RM</name>
                            <description>Reset Mode.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL_THE_CAN_CONTR</name>
                                    <description>Normal.The CAN Controller is in the Operating Mode,
                                        and certain registers can not be written.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESET_CAN_OPERATION</name>
                                    <description>Reset. CAN operation is disabled, writable
                                        registers can be written and the current
                                        transmission/reception of a message is aborted.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LOM</name>
                            <description>Listen Only Mode.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL_THE_CAN_CONT</name>
                                    <description>Normal. The CAN controller acknowledges a
                                        successfully received message on the CAN bus. The error
                                        counters are stopped at the current value.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LISTEN_ONLY_THE_CON</name>
                                    <description>Listen only. The controller gives no
                                        acknowledgment, even if a message is successfully received.
                                        Messages cannot be sent, and the controller operates in
                                        error passive mode. This mode is intended for software bit
                                        rate detection and hot plugging.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STM</name>
                            <description>Self Test Mode.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL_A_TRANSMITTE</name>
                                    <description>Normal. A transmitted message must be acknowledged
                                        to be considered successful.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELF_TEST_THE_CONTR</name>
                                    <description>Self test. The controller will consider a Tx
                                        message successful even if there is no acknowledgment
                                        received. In this mode a full node test is possible without
                                        any other active node on the bus using the SRR bit in
                                        CANxCMR.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TPM</name>
                            <description>Transmit Priority Mode.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CAN_ID_THE_TRANSMIT</name>
                                    <description>CAN ID. The transmit priority for 3 Transmit
                                        Buffers depends on the CAN Identifier.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOCAL_PRIORITY_THE_</name>
                                    <description>Local priority. The transmit priority for 3
                                        Transmit Buffers depends on the contents of the Tx Priority
                                        register within the Transmit Buffer.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SM</name>
                            <description>Sleep Mode.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>WAKE_UP_NORMAL_OPER</name>
                                    <description>Wake-up. Normal operation.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLEEP_THE_CAN_CONTR</name>
                                    <description>Sleep. The CAN controller enters Sleep Mode if no
                                        CAN interrupt is pending and there is no bus activity. See
                                        the Sleep Mode description Section 21.8.2 on page 565.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RPM</name>
                            <description>Receive Polarity Mode.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_ACTIVE_RD_INPUT</name>
                                    <description>Low active. RD input is active Low (dominant bit =
                                        0).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_ACTIVE_RD_INPU</name>
                                    <description>High active. RD input is active High (dominant bit
                                        = 1) -- reverse polarity.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>TM</name>
                            <description>Test Mode.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED_NORMAL_OPE</name>
                                    <description>Disabled. Normal operation.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED_THE_TD_PIN_</name>
                                    <description>Enabled. The TD pin will reflect the bit, detected
                                        on RD pin, with the next positive edge of the system clock.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMR</name>
                    <description>Command bits that affect the state of the CAN Controller</description>
                    <addressOffset>0x004</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TR</name>
                            <description>Transmission Request.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ABSENT_NO_TRANSMISSI</name>
                                    <description>Absent.No transmission request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PRESENT_THE_MESSAGE</name>
                                    <description>Present. The message, previously written to the
                                        CANxTFI, CANxTID, and optionally the CANxTDA and CANxTDB
                                        registers, is queued for transmission from the selected
                                        Transmit Buffer. If at two or all three of STB1, STB2 and
                                        STB3 bits are selected when TR=1 is written, Transmit Buffer
                                        will be selected based on the chosen priority scheme (for
                                        details see Section 21.5.3 Transmit Buffers (TXB))</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AT</name>
                            <description>Abort Transmission.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ACTION_DO_NOT_AB</name>
                                    <description>No action. Do not abort the transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PRESENT_IF_NOT_ALRE</name>
                                    <description>Present. if not already in progress, a pending
                                        Transmission Request for the selected Transmit Buffer is
                                        cancelled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RRB</name>
                            <description>Release Receive Buffer.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ACTION_DO_NOT_RE</name>
                                    <description>No action. Do not release the receive buffer.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RELEASED_THE_INFORM</name>
                                    <description>Released. The information in the Receive Buffer
                                        (consisting of CANxRFS, CANxRID, and if applicable the
                                        CANxRDA and CANxRDB registers) is released, and becomes
                                        eligible for replacement by the next received frame. If the
                                        next received frame is not available, writing this command
                                        clears the RBS bit in the Status Register(s).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CDO</name>
                            <description>Clear Data Overrun.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ACTION_DO_NOT_CL</name>
                                    <description>No action. Do not clear the data overrun bit.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLEAR_THE_DATA_OVER</name>
                                    <description>Clear. The Data Overrun bit in Status Register(s)
                                        is cleared.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SRR</name>
                            <description>Self Reception Request.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ABSENT_NO_SELF_RECE</name>
                                    <description>Absent. No self reception request.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PRESENT_THE_MESSAGE</name>
                                    <description>Present. The message, previously written to the
                                        CANxTFS, CANxTID, and optionally the CANxTDA and CANxTDB
                                        registers, is queued for transmission from the selected
                                        Transmit Buffer and received simultaneously. This differs
                                        from the TR bit above in that the receiver is not disabled
                                        during the transmission, so that it receives the message if
                                        its Identifier is recognized by the Acceptance Filter.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STB1</name>
                            <description>Select Tx Buffer 1.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_SELECTED_TX_BUF</name>
                                    <description>Not selected. Tx Buffer 1 is not selected for
                                        transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECTED_TX_BUFFER_</name>
                                    <description>Selected. Tx Buffer 1 is selected for transmission.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STB2</name>
                            <description>Select Tx Buffer 2.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_SELECTED_TX_BUF</name>
                                    <description>Not selected. Tx Buffer 2 is not selected for
                                        transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECTED_TX_BUFFER_</name>
                                    <description>Selected. Tx Buffer 2 is selected for transmission.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STB3</name>
                            <description>Select Tx Buffer 3.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_SELECTED_TX_BUF</name>
                                    <description>Not selected. Tx Buffer 3 is not selected for
                                        transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECTED_TX_BUFFER_</name>
                                    <description>Selected. Tx Buffer 3 is selected for transmission.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
