itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>GSR</name>
                    <description>Global Controller Status and Error Counters. The error counters can
                        only be written when RM in CANMOD is 1.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x3C</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBS</name>
                            <description>Receive Buffer Status. After reading all messages and
                                releasing their memory space with the command 'Release Receive
                                Buffer,' this bit is cleared.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>EMPTY_NO_MESSAGE_IS</name>
                                    <description>Empty. No message is available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL_AT_LEAST_ONE_C</name>
                                    <description>Full. At least one complete message is received by
                                        the Double Receive Buffer and available in the CANxRFS,
                                        CANxRID, and if applicable the CANxRDA and CANxRDB
                                        registers. This bit is cleared by the Release Receive Buffer
                                        command in CANxCMR, if no subsequent received message is
                                        available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOS</name>
                            <description>Data Overrun Status. If there is not enough space to store
                                the message within the Receive Buffer, that message is dropped and
                                the Data Overrun condition is signalled to the CPU in the moment
                                this message becomes valid. If this message is not completed
                                successfully (e.g. because of an error), no overrun condition is
                                signalled.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ABSENT_NO_DATA_OVER</name>
                                    <description>Absent. No data overrun has occurred since the last
                                        Clear Data Overrun command was given/written to CANxCMR (or
                                        since Reset).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OVERRUN_A_MESSAGE_W</name>
                                    <description>Overrun. A message was lost because the preceding
                                        message to this CAN controller was not read and released
                                        quickly enough (there was not enough space for a new message
                                        in the Double Receive Buffer).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TBS</name>
                            <description>Transmit Buffer Status.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOCKED_AT_LEAST_ONE</name>
                                    <description>Locked. At least one of the Transmit Buffers is not
                                        available for the CPU, i.e. at least one previously queued
                                        message for this CAN controller has not yet been sent, and
                                        therefore software should not write to the CANxTFI, CANxTID,
                                        CANxTDA, nor CANxTDB registers of that (those) Tx buffer(s).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RELEASED_ALL_THREE_</name>
                                    <description>Released. All three Transmit Buffers are available
                                        for the CPU. No transmit message is pending for this CAN
                                        controller (in any of the 3 Tx buffers), and software may
                                        write to any of the CANxTFI, CANxTID, CANxTDA, and CANxTDB
                                        registers.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCS</name>
                            <description>Transmit Complete Status. The Transmission Complete Status
                                bit is set '0' (incomplete) whenever the Transmission Request bit or
                                the Self Reception Request bit is set '1' at least for one of the
                                three Transmit Buffers. The Transmission Complete Status bit will
                                remain '0' until all messages are transmitted successfully.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INCOMPLETE_AT_LEAST</name>
                                    <description>Incomplete. At least one requested transmission has
                                        not been successfully completed yet.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPLETE_ALL_REQUES</name>
                                    <description>Complete. All requested transmission(s) has (have)
                                        been successfully completed.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RS</name>
                            <description>Receive Status. If both the Receive Status and the Transmit
                                Status bits are '0' (idle), the CAN-Bus is idle. If both bits are
                                set, the controller is waiting to become idle again. After hardware
                                reset 11 consecutive recessive bits have to be detected until idle
                                status is reached. After Bus-off this will take 128 times of 11
                                consecutive recessive bits.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE_THE_CAN_CONTRO</name>
                                    <description>Idle. The CAN controller is idle.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RECEIVE_THE_CAN_CON</name>
                                    <description>Receive. The CAN controller is receiving a message.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TS</name>
                            <description>Transmit Status. If both the Receive Status and the
                                Transmit Status bits are '0' (idle), the CAN-Bus is idle. If both
                                bits are set, the controller is waiting to become idle again. After
                                hardware reset 11 consecutive recessive bits have to be detected
                                until idle status is reached. After Bus-off this will take 128 times
                                of 11 consecutive recessive bits.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE_THE_CAN_CONTRO</name>
                                    <description>Idle. The CAN controller is idle.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRANSMIT_THE_CAN_CO</name>
                                    <description>Transmit. The CAN controller is sending a message.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ES</name>
                            <description>Error Status. Errors detected during reception or
                                transmission will effect the error counters according to the CAN
                                specification. The Error Status bit is set when at least one of the
                                error counters has reached or exceeded the Error Warning Limit. An
                                Error Warning Interrupt is generated, if enabled. The default value
                                of the Error Warning Limit after hardware reset is 96 decimal, see
                                also Section 21.7.7 CAN Error Warning Limit register (CAN1EWL -
                                0x4004 4018, CAN2EWL - 0x4004 8018).</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>OK_BOTH_ERROR_COUNT</name>
                                    <description>OK. Both error counters are below the Error Warning
                                        Limit.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ERROR_ONE_OR_BOTH_O</name>
                                    <description>Error. One or both of the Transmit and Receive
                                        Error Counters has reached the limit set in the Error
                                        Warning Limit register.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BS</name>
                            <description>Bus Status. Mode bit '1' (present) and an Error Warning
                                Interrupt is generated, if enabled. Afterwards the Transmit Error
                                Counter is set to '127', and the Receive Error Counter is cleared.
                                It will stay in this mode until the CPU clears the Reset Mode bit.
                                Once this is completed the CAN Controller will wait the minimum
                                protocol-defined time (128 occurrences of the Bus-Free signal)
                                counting down the Transmit Error Counter. After that, the Bus Status
                                bit is cleared (Bus-On), the Error Status bit is set '0' (ok), the
                                Error Counters are reset, and an Error Warning Interrupt is
                                generated, if enabled. Reading the TX Error Counter during this time
                                gives information about the status of the Bus-Off recovery.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUS_ON_THE_CAN_CONT</name>
                                    <description>Bus-on. The CAN Controller is involved in bus
                                        activities</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUS_OFF_THE_CAN_CON</name>
                                    <description>Bus-off. The CAN controller is currently not
                                        involved/prohibited from bus activity because the Transmit
                                        Error Counter reached its limiting value of 255.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RXERR</name>
                            <description>The current value of the Rx Error Counter (an 8-bit value).</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>TXERR</name>
                            <description>The current value of the Tx Error Counter (an 8-bit value).</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
