itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>SR</name>
                    <description>Status Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x3C3C3C</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBS_1</name>
                            <description>Receive Buffer Status. This bit is identical to the RBS bit
                                in the CANxGSR.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>DOS_1</name>
                            <description>Data Overrun Status. This bit is identical to the DOS bit
                                in the CANxGSR.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>TBS1_1</name>
                            <description>Transmit Buffer Status 1.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOCKED_SOFTWARE_CAN</name>
                                    <description>Locked. Software cannot access the Tx Buffer 1 nor
                                        write to the corresponding CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers because a message is either waiting for
                                        transmission or is in transmitting process.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RELEASED_SOFTWARE_M</name>
                                    <description>Released. Software may write a message into the
                                        Transmit Buffer 1 and its CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCS1_1</name>
                            <description>Transmission Complete Status.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INCOMPLETE_THE_PREV</name>
                                    <description>Incomplete. The previously requested transmission
                                        for Tx Buffer 1 is not complete.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPLETE_THE_PREVIO</name>
                                    <description>Complete. The previously requested transmission for
                                        Tx Buffer 1 has been successfully completed.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RS_1</name>
                            <description>Receive Status. This bit is identical to the RS bit in the
                                GSR.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>TS1_1</name>
                            <description>Transmit Status 1.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE_THERE_IS_NO_TR</name>
                                    <description>Idle. There is no transmission from Tx Buffer 1.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRANSMIT_THE_CAN_CO</name>
                                    <description>Transmit. The CAN Controller is transmitting a
                                        message from Tx Buffer 1.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ES_1</name>
                            <description>Error Status. This bit is identical to the ES bit in the
                                CANxGSR.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>BS_1</name>
                            <description>Bus Status. This bit is identical to the BS bit in the
                                CANxGSR.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RBS_2</name>
                            <description>Receive Buffer Status. This bit is identical to the RBS bit
                                in the CANxGSR.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>DOS_2</name>
                            <description>Data Overrun Status. This bit is identical to the DOS bit
                                in the CANxGSR.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>TBS2_2</name>
                            <description>Transmit Buffer Status 2.</description>
                            <bitRange>[10:10]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOCKED_SOFTWARE_CAN</name>
                                    <description>Locked. Software cannot access the Tx Buffer 2 nor
                                        write to the corresponding CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers because a message is either waiting for
                                        transmission or is in transmitting process.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RELEASED_SOFTWARE_M</name>
                                    <description>Released. Software may write a message into the
                                        Transmit Buffer 2 and its CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCS2_2</name>
                            <description>Transmission Complete Status.</description>
                            <bitRange>[11:11]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INCOMPLETE_THE_PREV</name>
                                    <description>Incomplete. The previously requested transmission
                                        for Tx Buffer 2 is not complete.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPLETE_THE_PREVIO</name>
                                    <description>Complete. The previously requested transmission for
                                        Tx Buffer 2 has been successfully completed.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RS_2</name>
                            <description>Receive Status. This bit is identical to the RS bit in the
                                GSR.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>TS2_2</name>
                            <description>Transmit Status 2.</description>
                            <bitRange>[13:13]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE_THERE_IS_NO_TR</name>
                                    <description>Idle. There is no transmission from Tx Buffer 2.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRANSMIT_THE_CAN_CO</name>
                                    <description>Transmit. The CAN Controller is transmitting a
                                        message from Tx Buffer 2.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ES_2</name>
                            <description>Error Status. This bit is identical to the ES bit in the
                                CANxGSR.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>BS_2</name>
                            <description>Bus Status. This bit is identical to the BS bit in the
                                CANxGSR.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RBS_3</name>
                            <description>Receive Buffer Status. This bit is identical to the RBS bit
                                in the CANxGSR.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>DOS_3</name>
                            <description>Data Overrun Status. This bit is identical to the DOS bit
                                in the CANxGSR.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>TBS3_3</name>
                            <description>Transmit Buffer Status 3.</description>
                            <bitRange>[18:18]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOCKED_SOFTWARE_CAN</name>
                                    <description>Locked. Software cannot access the Tx Buffer 3 nor
                                        write to the corresponding CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers because a message is either waiting for
                                        transmission or is in transmitting process.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RELEASED_SOFTWARE_M</name>
                                    <description>Released. Software may write a message into the
                                        Transmit Buffer 3 and its CANxTFI, CANxTID, CANxTDA, and
                                        CANxTDB registers.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TCS3_3</name>
                            <description>Transmission Complete Status.</description>
                            <bitRange>[19:19]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INCOMPLETE_THE_PREV</name>
                                    <description>Incomplete. The previously requested transmission
                                        for Tx Buffer 3 is not complete.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPLETE_THE_PREVIO</name>
                                    <description>Complete. The previously requested transmission for
                                        Tx Buffer 3 has been successfully completed.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RS_3</name>
                            <description>Receive Status. This bit is identical to the RS bit in the
                                GSR.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>TS3_3</name>
                            <description>Transmit Status 3.</description>
                            <bitRange>[21:21]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>IDLE_THERE_IS_NO_TR</name>
                                    <description>Idle. There is no transmission from Tx Buffer 3.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRANSMIT_THE_CAN_CO</name>
                                    <description>Transmit. The CAN Controller is transmitting a
                                        message from Tx Buffer 3.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ES_3</name>
                            <description>Error Status. This bit is identical to the ES bit in the
                                CANxGSR.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>BS_3</name>
                            <description>Bus Status. This bit is identical to the BS bit in the
                                CANxGSR.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, the value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFS</name>
                    <description>Receive frame status. Can only be written when RM in CANMOD is 1.</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IDINDEX</name>
                            <description>ID Index. If the BP bit (below) is 0, this value is the
                                zero-based number of the Lookup Table RAM entry at which the
                                Acceptance Filter matched the received Identifier. Disabled entries
                                in the Standard tables are included in this numbering, but will not
                                be matched. See Section 21.17 Examples of acceptance filter tables
                                and ID index values on page 587 for examples of ID Index values.</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                        <field>
                            <name>BP</name>
                            <description>If this bit is 1, the current message was received in AF
                                Bypass mode, and the ID Index field (above) is meaningless.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[15:11]</bitRange>
                        </field>
                        <field>
                            <name>DLC</name>
                            <description>The field contains the Data Length Code (DLC) field of the
                                current received message. When RTR = 0, this is related to the
                                number of data bytes available in the CANRDA and CANRDB registers as
                                follows: 0000-0111 = 0 to 7 bytes1000-1111 = 8 bytes With RTR = 1,
                                this value indicates the number of data bytes requested to be sent
                                back, with the same encoding.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[29:20]</bitRange>
                        </field>
                        <field>
                            <name>RTR</name>
                            <description>This bit contains the Remote Transmission Request bit of
                                the current received message. 0 indicates a Data Frame, in which (if
                                DLC is non-zero) data can be read from the CANRDA and possibly the
                                CANRDB registers. 1 indicates a Remote frame, in which case the DLC
                                value identifies the number of data bytes requested to be sent using
                                the same Identifier.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>FF</name>
                            <description>A 0 in this bit indicates that the current received message
                                included an 11-bit Identifier, while a 1 indicates a 29-bit
                                Identifier. This affects the contents of the CANid register
                                described below.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RID</name>
                    <description>Received Identifier. Can only be written when RM in CANMOD is 1.</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ID</name>
                            <description>The 11-bit Identifier field of the current received
                                message. In CAN 2.0A, these bits are called ID10-0, while in CAN
                                2.0B they're called ID29-18.</description>
                            <bitRange>[10:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:11]</bitRange>
                        </field>
                    </fields>
                </register>
