itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>ICR</name>
                    <description>IrDA Control Register. Enables and configures the IrDA mode.</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IRDAEN</name>
                            <description>IrDA mode</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED_IRDA_MODE_</name>
                                    <description>Disabled. IrDA mode on UART4 is disabled, UART4
                                        acts as a standard UART.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED_IRDA_MODE_O</name>
                                    <description>Enabled. IrDA mode on UART4 is enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IRDAINV</name>
                            <description>Serial input direction.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_INVERTED_</name>
                                    <description>Not inverted.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INVERTED_THIS_HAS_N</name>
                                    <description>Inverted. This has no effect on the serial output.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FIXPULSEEN</name>
                            <description>IrDA fixed pulse width mode.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED_</name>
                                    <description>Disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED_</name>
                                    <description>Enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PULSEDIV</name>
                            <description>Configures the pulse when FixPulseEn = 1.</description>
                            <bitRange>[5:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>2XTPCLK</name>
                                    <description>2xTPCLK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4XTPCLK</name>
                                    <description>4xTPCLK</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8XTPCLK</name>
                                    <description>8xTPCLK</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16XTPCLK</name>
                                    <description>16xTPCLK</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32XTPCLK</name>
                                    <description>32xTPCLK</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>64XTPCLK</name>
                                    <description>64xTPCLK</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>128XTPCLK</name>
                                    <description>128xTPCLK</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256XTPCLK</name>
                                    <description>256xTPCLK</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDR</name>
                    <description>Fractional Divider Register. Generates a clock input for the baud
                        rate divider.</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DIVADDVAL</name>
                            <description>Baud Rate generation pre-scaler divisor value. If this
                                field is 0, fractional baud rate generator will not impact the UART4
                                baud rate.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>MULVAL</name>
                            <description>Baud Rate pre-scaler multiplier value. This field must be
                                greater or equal 1 for UART4 to operate properly, regardless of
                                whether the fractional baud rate generator is used or not.</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSR</name>
                    <description>Oversampling register. Controls the degree of oversampling during
                        each bit time.</description>
                    <addressOffset>0x02C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0xF0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>OSFRAC</name>
                            <description>Fractional part of the oversampling ratio, in units of
                                1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>
                            <bitRange>[3:1]</bitRange>
                        </field>
                        <field>
                            <name>OSINT</name>
                            <description>Integer part of the oversampling ratio, minus 1. The reset
                                values equate to the normal operating mode of 16 input clocks per
                                bit time.</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>FDINT</name>
                            <description>In smartcard mode, these bits act as a more-significant
                                extension of the OSint field, allowing an oversampling ratio up to
                                2048 as required by ISO7816-3. In smartcard mode, bits 14:4 should
                                initially be set to 371, yielding an oversampling ratio of 372.</description>
                            <bitRange>[14:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCICTRL</name>
                    <description>Smart Card Interface control register. Enables and configures the
                        smartcard Interface feature.</description>
                    <addressOffset>0x048</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCIEN</name>
                            <description>Smart Card Interface Enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SMART_CARD_INTERFACE</name>
                                    <description>Smart card interface disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ASYNCHRONOUS_HALF_DU</name>
                                    <description>Asynchronous half duplex smart card interface is
                                        enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NACKDIS</name>
                            <description>NACK response disable. Only applicable in T=0.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>A_NACK_RESPONSE_IS_E</name>
                                    <description>A NACK response is enabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>A_NACK_RESPONSE_IS_I</name>
                                    <description>A NACK response is inhibited.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTSEL</name>
                            <description>Protocol selection as defined in the ISO7816-3 standard.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>T_EQ_0</name>
                                    <description>T = 0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>T_EQ_1</name>
                                    <description>T = 1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXRETRY</name>
                            <description>Maximum number of retransmissions in case of a negative
                                acknowledge (protocol T=0). When the retry counter is exceeded, the
                                USART will be locked until the FIFO is cleared. A TX error interrupt
                                is generated when enabled.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                        <field>
                            <name>GUARDTIME</name>
                            <description>Extra guard time. No extra guard time (0x0) results in a
                                standard guard time as defined in ISO 7816-3, depending on the
                                protocol type. A guard time of 0xFF indicates a minimal guard time
                                as defined for the selected protocol.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RS485CTRL</name>
                    <description>RS-485/EIA-485 Control. Contains controls to configure various
                        aspects of RS-485/EIA-485 modes.</description>
                    <addressOffset>0x04C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NMMEN</name>
                            <description>NMM enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
                                        disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is
                                        enabled. In this mode, an address is detected when a
                                        received byte causes the USART to set the parity error and
                                        generate an interrupt. See Section 20.6.18 RS-485/EIA-485
                                        modes of operation.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXDIS</name>
                            <description>Receiver enable.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ENABLED_</name>
                                    <description>Enabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLED_</name>
                                    <description>Disabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AADEN</name>
                            <description>AAD enable</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED_</name>
                                    <description>Disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED_</name>
                                    <description>Enabled.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>DCTRL</name>
                            <description>Direction control for DIR pin.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_AUTO_DIRECTI</name>
                                    <description>Disable Auto Direction Control.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_AUTO_DIRECTIO</name>
                                    <description>Enable Auto Direction Control.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OINV</name>
                            <description>Direction control pin polarity. This bit reverses the
                                polarity of the direction control signal on the DIR pin.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_THE_DIRECTION_C</name>
                                    <description>Low. The direction control pin will be driven to
                                        logic 0 when the transmitter has data to be sent. It will be
                                        driven to logic 1 after the last bit of data has been
                                        transmitted.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_THE_DIRECTION_</name>
                                    <description>High. The direction control pin will be driven to
                                        logic 1 when the transmitter has data to be sent. It will be
                                        driven to logic 0 after the last bit of data has been
                                        transmitted.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
