itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>RS485ADRMATCH</name>
                    <description>RS-485/EIA-485 address match. Contains the address match value for
                        RS-485/EIA-485 mode.</description>
                    <addressOffset>0x050</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADRMATCH</name>
                            <description>Contains the address match value.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RS485DLY</name>
                    <description>RS-485/EIA-485 direction control delay.</description>
                    <addressOffset>0x054</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLY</name>
                            <description>Contains the direction control (U4OE) delay value. This
                                register works in conjunction with an 8-bit counter.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCCTRL</name>
                    <description>Synchronous mode control register.</description>
                    <addressOffset>0x058</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYNC</name>
                            <description>Enables synchronous mode.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>Disabled</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>Enabled</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSRC</name>
                            <description>Clock source select.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SYNCHRONOUS_SLAVE_MO</name>
                                    <description>Synchronous slave mode (SCLK in)</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYNCHRONOUS_MASTER_M</name>
                                    <description>Synchronous master mode (SCLK out)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FES</name>
                            <description>Falling edge sampling.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>RXD_IS_SAMPLED_ON_TH</name>
                                    <description>RxD is sampled on the rising edge of SCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXD_IS_SAMPLED_ON_TH</name>
                                    <description>RxD is sampled on the falling edge of SCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TSBYPASS</name>
                            <description>Transmit synchronization bypass in synchronous slave mode.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_INPUT_CLOCK_IS_S</name>
                                    <description>The input clock is synchronized prior to being used
                                        in clock edge detection logic.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_INPUT_CLOCK_IS_N</name>
                                    <description>The input clock is not synchronized prior to being
                                        used in clock edge detection logic. This allows for a high
                                        er input clock rate at the expense of potential
                                        metastability.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCEN</name>
                            <description>Continuous master clock enable (used only when CSRC is 1)</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SCLK_CYCLES_ONLY_WHE</name>
                                    <description>SCLK cycles only when characters are being sent on
                                        TxD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SCLK_RUNS_CONTINUOUS</name>
                                    <description>SCLK runs continuously (characters can be received
                                        on RxD independently from transmission on TxD)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SSSDIS</name>
                            <description>Start/stop bits</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SEND_START_AND_STOP_</name>
                                    <description>Send start and stop bits as in other modes.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOSTARTSTOPBIT</name>
                                    <description>Do not send start/stop bits.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCLR</name>
                            <description>Continuous clock clear</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>CSCEN_IS_UNDER_SOFTW</name>
                                    <description>CSCEN is under software control.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HARDWARE_CLEARS_CSCE</name>
                                    <description>Hardware clears CSCEN after each character is
                                        received.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
