itzandroidtab/klib-svd/lpc1788.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>I2S</name>
            <description>I2S interface</description>
            <groupName>I2S</groupName>
            <baseAddress>0x400A8000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>I2S</name>
                <value>27</value>
            </interrupt>
            <registers>
                <register>
                    <name>DAO</name>
                    <description>I2S Digital Audio Output Register. Contains control bits for the
                        I2S transmit channel.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x87E1</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WORDWIDTH</name>
                            <description>Selects the number of bytes in data as follows:</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>8_BIT_DATA</name>
                                    <description>8-bit data</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_BIT_DATA</name>
                                    <description>16-bit data</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32_BIT_DATA</name>
                                    <description>32-bit data</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONO</name>
                            <description>When 1, data is of monaural format. When 0, the data is in
                                stereo format.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>When 1, disables accesses on FIFOs, places the transmit
                                channel in mute mode.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESET</name>
                            <description>When 1, asynchronously resets the transmit channel and
                                FIFO.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>WS_SEL</name>
                            <description>When 0, the interface is in master mode. When 1, the
                                interface is in slave mode. See Section 34.7.2 for a summary of
                                useful combinations for this bit with TXMODE.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>WS_HALFPERIOD</name>
                            <description>Word select half period minus 1, i.e. WS 64clk period ->
                                ws_halfperiod = 31.</description>
                            <bitRange>[14:6]</bitRange>
                        </field>
                        <field>
                            <name>MUTE</name>
                            <description>When 1, the transmit channel sends only zeroes.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAI</name>
                    <description>I2S Digital Audio Input Register. Contains control bits for the I2S
                        receive channel.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x07E1</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WORDWIDTH</name>
                            <description>Selects the number of bytes in data as follows:</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>8_BIT_DATA</name>
                                    <description>8-bit data</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_BIT_DATA</name>
                                    <description>16-bit data</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>32_BIT_DATA</name>
                                    <description>32-bit data</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MONO</name>
                            <description>When 1, data is of monaural format. When 0, the data is in
                                stereo format.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>When 1, disables accesses on FIFOs, places the transmit
                                channel in mute mode.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESET</name>
                            <description>When 1, asynchronously reset the transmit channel and FIFO.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>WS_SEL</name>
                            <description>When 0, the interface is in master mode. When 1, the
                                interface is in slave mode. See Section 34.7.2 for a summary of
                                useful combinations for this bit with RXMODE.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>WS_HALFPERIOD</name>
                            <description>Word select half period minus 1, i.e. WS 64clk period ->
                                ws_halfperiod = 31.</description>
                            <bitRange>[14:6]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:15]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXFIFO</name>
                    <description>I2S Transmit FIFO. Access register for the 8 x 32-bit transmitter
                        FIFO.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I2STXFIFO</name>
                            <description>8 x 32-bit transmit FIFO.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFIFO</name>
                    <description>I2S Receive FIFO. Access register for the 8 x 32-bit receiver FIFO.</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I2SRXFIFO</name>
                            <description>8 x 32-bit transmit FIFO.</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATE</name>
                    <description>I2S Status Feedback Register. Contains status information about the
                        I2S interface.</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IRQ</name>
                            <description>This bit reflects the presence of Receive Interrupt or
                                Transmit Interrupt. This is determined by comparing the current FIFO
                                levels to the rx_depth_irq and tx_depth_irq fields in the IRQ
                                register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>DMAREQ1</name>
                            <description>This bit reflects the presence of Receive or Transmit DMA
                                Request 1. This is determined by comparing the current FIFO levels
                                to the rx_depth_dma1 and tx_depth_dma1 fields in the DMA1 register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>DMAREQ2</name>
                            <description>This bit reflects the presence of Receive or Transmit DMA
                                Request 2. This is determined by comparing the current FIFO levels
                                to the rx_depth_dma2 and tx_depth_dma2 fields in the DMA2 register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:3]</bitRange>
                        </field>
                        <field>
                            <name>RX_LEVEL</name>
                            <description>Reflects the current level of the Receive FIFO.</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>TX_LEVEL</name>
                            <description>Reflects the current level of the Transmit FIFO.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA1</name>
                    <description>I2S DMA Configuration Register 1. Contains control information for
                        DMA request 1.</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_DMA1_ENABLE</name>
                            <description>When 1, enables DMA1 for I2S receive.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TX_DMA1_ENABLE</name>
                            <description>When 1, enables DMA1 for I2S transmit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>RX_DEPTH_DMA1</name>
                            <description>Set the FIFO level that triggers a receive DMA request on
                                DMA1.</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>TX_DEPTH_DMA1</name>
                            <description>Set the FIFO level that triggers a transmit DMA request on
                                DMA1.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA2</name>
                    <description>I2S DMA Configuration Register 2. Contains control information for
                        DMA request 2.</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_DMA2_ENABLE</name>
                            <description>When 1, enables DMA1 for I2S receive.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TX_DMA2_ENABLE</name>
                            <description>When 1, enables DMA1 for I2S transmit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>RX_DEPTH_DMA2</name>
                            <description>Set the FIFO level that triggers a receive DMA request on
                                DMA2.</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>TX_DEPTH_DMA2</name>
                            <description>Set the FIFO level that triggers a transmit DMA request on
                                DMA2.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQ</name>
                    <description>I2S Interrupt Request Control Register. Contains bits that control
                        how the I2S interrupt request is generated.</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_IRQ_ENABLE</name>
                            <description>When 1, enables I2S receive interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TX_IRQ_ENABLE</name>
                            <description>When 1, enables I2S transmit interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[7:2]</bitRange>
                        </field>
                        <field>
                            <name>RX_DEPTH_IRQ</name>
                            <description>Set the FIFO level on which to create an irq request.</description>
                            <bitRange>[11:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[15:12]</bitRange>
                        </field>
                        <field>
                            <name>TX_DEPTH_IRQ</name>
                            <description>Set the FIFO level on which to create an irq request.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXRATE</name>
                    <description>I2S Transmit MCLK divider. This register determines the I2S TX MCLK
                        rate by specifying the value to divide PCLK by in order to produce MCLK.</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Y_DIVIDER</name>
                            <description>I2S transmit MCLK rate denominator. This value is used to
                                divide PCLK to produce the transmit MCLK. Eight bits of fractional
                                divide supports a wide range of possibilities. A value of 0 stops
                                the clock.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>X_DIVIDER</name>
                            <description>I2S transmit MCLK rate numerator. This value is used to
                                multiply PCLK by to produce the transmit MCLK. A value of 0 stops
                                the clock. Eight bits of fractional divide supports a wide range of
                                possibilities. Note: the resulting ratio X/Y is divided by 2.</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
