itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>IES</name>
                    <description>Interrupt enable set register</description>
                    <addressOffset>0xFDC</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>INX_INT</name>
                            <description>Writing a 1 enables the INX_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TIM_INT</name>
                            <description>Writing a 1 enables the TIN_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>VELC_INT</name>
                            <description>Writing a 1 enables the VELC_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DIR_INT</name>
                            <description>Writing a 1 enables the DIR_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INT</name>
                            <description>Writing a 1 enables the ERR_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>ENCLK_INT</name>
                            <description>Writing a 1 enables the ENCLK_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>POS0_INT</name>
                            <description>Writing a 1 enables the POS0_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>POS1_INT</name>
                            <description>Writing a 1 enables the POS1_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>POS2_INT</name>
                            <description>Writing a 1 enables the POS2_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>REV0_INT</name>
                            <description>Writing a 1 enables the REV0_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>POS0REV_INT</name>
                            <description>Writing a 1 enables the POS0REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>POS1REV_INT</name>
                            <description>Writing a 1 enables the POS1REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>POS2REV_INT</name>
                            <description>Writing a 1 enables the POS2REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>REV1_INT</name>
                            <description>Writing a 1 enables the REV1_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>REV2_INT</name>
                            <description>Writing a 1 enables the REV2_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>MAXPOS_INT</name>
                            <description>Writing a 1 enables the MAXPOS_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IEC</name>
                    <description>Interrupt enable clear register</description>
                    <addressOffset>0xFD8</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>INX_INT</name>
                            <description>Writing a 1 disables the INX_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TIM_INT</name>
                            <description>Writing a 1 disables the TIN_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>VELC_INT</name>
                            <description>Writing a 1 disables the VELC_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DIR_INT</name>
                            <description>Writing a 1 disables the DIR_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>ERR_INT</name>
                            <description>Writing a 1 disables the ERR_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>ENCLK_INT</name>
                            <description>Writing a 1 disables the ENCLK_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>POS0_INT</name>
                            <description>Writing a 1 disables the POS0_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>POS1_INT</name>
                            <description>Writing a 1 disables the POS1_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>POS2_INT</name>
                            <description>Writing a 1 disables the POS2_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>REV0_INT</name>
                            <description>Writing a 1 disables the REV0_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>POS0REV_INT</name>
                            <description>Writing a 1 disables the POS0REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>POS1REV_INT</name>
                            <description>Writing a 1 disables the POS1REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>POS2REV_INT</name>
                            <description>Writing a 1 disables the POS2REV_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>REV1_INT</name>
                            <description>Writing a 1 disables the REV1_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>REV2_INT</name>
                            <description>Writing a 1 disables the REV2_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>MAXPOS_INT</name>
                            <description>Writing a 1 disables the MAXPOS_Int interrupt in the QEIIE
                                register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
