itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>PCONP</name>
                    <description>Power Control for Peripherals</description>
                    <addressOffset>0x0C4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x0408829E</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCLCD</name>
                            <description>LCD controller power/clock control bit.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM0</name>
                            <description>Timer/Counter 0 power/clock control bit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM1</name>
                            <description>Timer/Counter 1 power/clock control bit.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PCUART0</name>
                            <description>UART0 power/clock control bit.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>PCUART1</name>
                            <description>UART1 power/clock control bit.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>PCPWM0</name>
                            <description>PWM0 power/clock control bit.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PCPWM1</name>
                            <description>PWM1 power/clock control bit.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C0</name>
                            <description>I2C0 interface power/clock control bit.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>PCUART4</name>
                            <description>UART4 power/clock control bit.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PCRTC</name>
                            <description>RTC and Event Monitor/Recorder power/clock control bit.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PCSSP1</name>
                            <description>SSP 1 interface power/clock control bit.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>PCEMC</name>
                            <description>External Memory Controller power/clock control bit.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>PCADC</name>
                            <description>A/D converter (ADC) power/clock control bit. Note: Clear
                                the PDN bit in the AD0CR before clearing this bit, and set this bit
                                before attempting to set PDN.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>PCCAN1</name>
                            <description>CAN Controller 1 power/clock control bit.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>PCCAN2</name>
                            <description>CAN Controller 2 power/clock control bit.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>PCGPIO</name>
                            <description>Power/clock control bit for IOCON, GPIO, and GPIO
                                interrupts.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>PCSPIFI</name>
                            <description>SPI Flash Interface power/clock control bit (LPC1773 only).</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>PCMCPWM</name>
                            <description>Motor Control PWM power/clock control bit.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>PCQEI</name>
                            <description>Quadrature Encoder Interface power/clock control bit.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C1</name>
                            <description>I2C1 interface power/clock control bit.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>PCSSP2</name>
                            <description>SSP2 interface power/clock control bit.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>PCSSP0</name>
                            <description>SSP0 interface power/clock control bit.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM2</name>
                            <description>Timer 2 power/clock control bit.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM3</name>
                            <description>Timer 3 power/clock control bit.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>PCUART2</name>
                            <description>UART 2 power/clock control bit.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>PCUART3</name>
                            <description>UART 3 power/clock control bit.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C2</name>
                            <description>I2C interface 2 power/clock control bit.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>PCI2S</name>
                            <description>I2S interface power/clock control bit.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PCSDC</name>
                            <description>SD Card interface power/clock control bit.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>PCGPDMA</name>
                            <description>GPDMA function power/clock control bit.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>PCENET</name>
                            <description>Ethernet block power/clock control bit.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>PCUSB</name>
                            <description>USB interface power/clock control bit.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMCCLKSEL</name>
                    <description>External Memory Controller Clock Selection register</description>
                    <addressOffset>0x100</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EMCDIV</name>
                            <description>Selects the EMC clock rate relative to the CPU clock.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_EMC_USES_THE_SAM</name>
                                    <description>The EMC uses the same clock as the CPU.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_EMC_USES_A_CLOCK</name>
                                    <description>The EMC uses a clock at half the rate of the CPU.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCLKSEL</name>
                    <description>CPU Clock Selection register</description>
                    <addressOffset>0x104</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>CCLKDIV</name>
                            <description>Selects the divide value for creating the CPU clock (CCLK)
                                from the selected clock source. 0 = The divider is turned off., no
                                clock will be provided to the CPU. This setting should typically not
                                be used, the CPU will be halted and a reset will be required to
                                restore operation. 1 = The input clock is divided by 1 to produce
                                the CPU clock. 2 = The input clock is divided by 2 to produce the
                                CPU clock. 3 = The input clock is divided by 3 to produce the CPU
                                clock. ... 31 = The input clock is divided by 31 to produce the CPU
                                clock.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                        <field>
                            <name>CCLKSEL</name>
                            <description>Selects the input clock for the CPU clock divider.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SYSCLK_IS_USED_AS_TH</name>
                                    <description>Sysclk is used as the input to the CPU clock
                                        divider.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_OUTPUT_OF_THE_MA</name>
                                    <description>The output of the Main PLL is used as the input to
                                        the CPU clock divider.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCLKSEL</name>
                    <description>USB Clock Selection register</description>
                    <addressOffset>0x108</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>USBDIV</name>
                            <description>Selects the divide value for creating the USB clock from
                                the selected PLL output. Only the values shown below can produce
                                even number multiples of 48 MHz from the PLL. Warning: Improper
                                setting of this value will result in incorrect operation of the USB
                                interface. Only the main oscillator in conjunction with either PLL0
                                or PLL1 can provide a clock that meets USB accuracy and jitter
                                specifications. Other values cannot produce the 48 MHz clock
                                required for USB operation.</description>
                            <bitRange>[4:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_DIVIDER_IS_TURNE</name>
                                    <description>The divider is turned off, no clock will be
                                        provided to the USB subsystem.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL0_OUTPUT_IS_DIVID</name>
                                    <description>PLL0 output is divided by 4. PLL0 output must be
                                        192 MHz.</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL0_OUTPUT_IS_DIVID</name>
                                    <description>PLL0 output is divided by 6. PLL0 output must be
                                        288 MHz.</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                        <field>
                            <name>USBSEL</name>
                            <description>Selects the input clock for the USB clock divider.</description>
                            <bitRange>[9:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SYSCLK_IS_USED_AS_TH</name>
                                    <description>Sysclk is used as the input to the USB clock
                                        divider. When this clock is selected, the USB can be
                                        accessed by software but cannot perform USB functions.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_OUTPUT_OF_THE_MA</name>
                                    <description>The output of the Main PLL is used as the input to
                                        the USB clock divider.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_OUTPUT_OF_THE_AL</name>
                                    <description>The output of the Alt PLL is used as the input to
                                        the USB clock divider.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKSRCSEL</name>
                    <description>Clock Source Select Register</description>
                    <addressOffset>0x10C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKSRC</name>
                            <description>Selects the clock source for sysclk and PLL0 as follows:</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SELECTS_THE_INTERNAL</name>
                                    <description>Selects the Internal RC oscillator as the sysclk
                                        and PLL0 clock source (default).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SELECTS_THE_MAIN_OSC</name>
                                    <description>Selects the main oscillator as the sysclk and PLL0
                                        clock source.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CANSLEEPCLR</name>
                    <description>Allows clearing the current CAN channel sleep state as well as
                        reading that state.</description>
                    <addressOffset>0x110</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>CAN1SLEEP</name>
                            <description>Sleep status and control for CAN channel 1. Read: when 1,
                                indicates that CAN channel 1 is in the sleep mode. Write: writing a
                                1 causes clocks to be restored to CAN channel 1.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>CAN2SLEEP</name>
                            <description>Sleep status and control for CAN channel 2. Read: when 1,
                                indicates that CAN channel 2 is in the sleep mode. Write: writing a
                                1 causes clocks to be restored to CAN channel 2.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
