itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>CANWAKEFLAGS</name>
                    <description>Allows reading the wake-up state of the CAN channels.</description>
                    <addressOffset>0x114</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>CAN1WAKE</name>
                            <description>Wake-up status for CAN channel 1. Read: when 1, indicates
                                that a falling edge has occurred on the receive data line of CAN
                                channel 1. Write: writing a 1 clears this bit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>CAN2WAKE</name>
                            <description>Wake-up status for CAN channel 2. Read: when 1, indicates
                                that a falling edge has occurred on the receive data line of CAN
                                channel 2. Write: writing a 1 clears this bit.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTINT</name>
                    <description>External Interrupt Flag Register</description>
                    <addressOffset>0x140</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EINT0</name>
                            <description>In level-sensitive mode, this bit is set if the EINT0
                                function is selected for its pin, and the pin is in its active
                                state. In edge-sensitive mode, this bit is set if the EINT0 function
                                is selected for its pin, and the selected edge occurs on the pin.
                                This bit is cleared by writing a one to it, except in level
                                sensitive mode when the pin is in its active state.[1]</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EINT1</name>
                            <description>In level-sensitive mode, this bit is set if the EINT1
                                function is selected for its pin, and the pin is in its active
                                state. In edge-sensitive mode, this bit is set if the EINT1 function
                                is selected for its pin, and the selected edge occurs on the pin.
                                This bit is cleared by writing a one to it, except in level
                                sensitive mode when the pin is in its active state.[1]</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EINT2</name>
                            <description>In level-sensitive mode, this bit is set if the EINT2
                                function is selected for its pin, and the pin is in its active
                                state. In edge-sensitive mode, this bit is set if the EINT2 function
                                is selected for its pin, and the selected edge occurs on the pin.
                                This bit is cleared by writing a one to it, except in level
                                sensitive mode when the pin is in its active state.[1]</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EINT3</name>
                            <description>In level-sensitive mode, this bit is set if the EINT3
                                function is selected for its pin, and the pin is in its active
                                state. In edge-sensitive mode, this bit is set if the EINT3 function
                                is selected for its pin, and the selected edge occurs on the pin.
                                This bit is cleared by writing a one to it, except in level
                                sensitive mode when the pin is in its active state.[1]</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTMODE</name>
                    <description>External Interrupt Mode register</description>
                    <addressOffset>0x148</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXTMODE0</name>
                            <description>Level or edge sensitivity select for EINT0.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LEVEL_SENSITIVE_</name>
                                    <description>Level sensitive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EDGE_SENSITIVE_</name>
                                    <description>Edge sensitive.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTMODE1</name>
                            <description>Level or edge sensitivity select for EINT1.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LEVEL_SENSITIVE_</name>
                                    <description>Level sensitive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EDGE_SENSITIVE_</name>
                                    <description>Edge sensitive.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTMODE2</name>
                            <description>Level or edge sensitivity select for EINT2.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LEVEL_SENSITIVE_</name>
                                    <description>Level sensitive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EDGE_SENSITIVE_</name>
                                    <description>Edge sensitive.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTMODE3</name>
                            <description>Level or edge sensitivity select for EINT3.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LEVEL_SENSITIVE_</name>
                                    <description>Level sensitive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EDGE_SENSITIVE_</name>
                                    <description>Edge sensitive.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTPOLAR</name>
                    <description>External Interrupt Polarity Register</description>
                    <addressOffset>0x14C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXTPOLAR0</name>
                            <description>External interrupt polarity for EINT0.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_ACTIVE_OR_FALLIN</name>
                                    <description>Low-active or falling-edge sensitive (depending on
                                        EXTMODE0).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_ACTIVE_OR_RISIN</name>
                                    <description>High-active or rising-edge sensitive (depending on
                                        EXTMODE0).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTPOLAR1</name>
                            <description>External interrupt polarity for EINT1.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_ACTIVE_OR_FALLIN</name>
                                    <description>Low-active or falling-edge sensitive (depending on
                                        EXTMODE1).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_ACTIVE_OR_RISIN</name>
                                    <description>High-active or rising-edge sensitive (depending on
                                        EXTMODE1).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTPOLAR2</name>
                            <description>External interrupt polarity for EINT2.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_ACTIVE_OR_FALLIN</name>
                                    <description>Low-active or falling-edge sensitive (depending on
                                        EXTMODE2).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_ACTIVE_OR_RISIN</name>
                                    <description>High-active or rising-edge sensitive (depending on
                                        EXTMODE2).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTPOLAR3</name>
                            <description>External interrupt polarity for EINT3.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>LOW_ACTIVE_OR_FALLIN</name>
                                    <description>Low-active or falling-edge sensitive (depending on
                                        EXTMODE3).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH_ACTIVE_OR_RISIN</name>
                                    <description>High-active or rising-edge sensitive (depending on
                                        EXTMODE3).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSID</name>
                    <description>Reset Source Identification Register</description>
                    <addressOffset>0x180</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>POR</name>
                            <description>Assertion of the POR signal sets this bit, and clears all
                                of the other bits in this register. But if another Reset signal
                                (e.g., External Reset) remains asserted after the POR signal is
                                negated, then its bit is set. This bit is not affected by any of the
                                other sources of Reset.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EXTR</name>
                            <description>Assertion of the external RESET signal sets this bit. This
                                bit is cleared only by software or POR.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>WDTR</name>
                            <description>This bit is set when the Watchdog Timer times out and the
                                WDTRESET bit in the Watchdog Mode Register is 1. This bit is cleared
                                only by software or POR.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>BODR</name>
                            <description>This bit is set when the VDD(REG)(3V3) voltage reaches a
                                level below the BOD reset trip level (typically 1.85 V under nominal
                                room temperature conditions). If the VDD(REG)(3V3) voltage dips from
                                the normal operating range to below the BOD reset trip level and
                                recovers, the BODR bit will be set to 1. If the VDD(REG)(3V3)
                                voltage dips from the normal operating range to below the BOD reset
                                trip level and continues to decline to the level at which POR is
                                asserted (nominally 1 V), the BODR bit is cleared. If the
                                VDD(REG)(3V3) voltage rises continuously from below 1 V to a level
                                above the BOD reset trip level, the BODR will be set to 1. This bit
                                is cleared only by software or POR. Note: Only in the case where a
                                reset occurs and the POR = 0, the BODR bit indicates if the
                                VDD(REG)(3V3) voltage was below the BOD reset trip level or not.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SYSRESET</name>
                            <description>This bit is set if the processor has been reset due to a
                                system reset request, as described in Section 40.4.3.6 Application
                                Interrupt and Reset Control Register. Setting the SYSRESETREQ bit in
                                the Cortex-M3 AIRCR register causes a chip reset in the
                                LPC178x/177x. This bit is cleared only by software or POR.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>LOCKUP</name>
                            <description>This bit is set if the processor has been reset due to a
                                lockup, as described in Section 40.3.4.4 Lockup. The lockup state
                                causes a chip reset in the LPC178x/177x. This bit is cleared only by
                                software or POR.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:6]</bitRange>
                        </field>
                    </fields>
                </register>
