itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>MATRIXARB</name>
                    <description>Matrix arbitration register</description>
                    <addressOffset>0x188</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>PRI_ICODE</name>
                            <description>I-Code bus priority. Should be lower than PRI_DCODE for
                                proper operation.</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>PRI_DCODE</name>
                            <description>D-Code bus priority.</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>PRI_SYS</name>
                            <description>System bus priority.</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>PRI_GPDMA</name>
                            <description>General Purpose DMA controller priority.</description>
                            <bitRange>[7:6]</bitRange>
                        </field>
                        <field>
                            <name>PRI_ETH</name>
                            <description>Ethernet DMA priority.</description>
                            <bitRange>[9:8]</bitRange>
                        </field>
                        <field>
                            <name>PRI_LCD</name>
                            <description>LCD DMA priority.</description>
                            <bitRange>[11:10]</bitRange>
                        </field>
                        <field>
                            <name>PRI_USB</name>
                            <description>USB DMA priority.</description>
                            <bitRange>[13:12]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:14]</bitRange>
                        </field>
                        <field>
                            <name>ROM_LAT</name>
                            <description>ROM latency select. Should always be 0.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:17]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCS</name>
                    <description>System Control and Status</description>
                    <addressOffset>0x1A0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EMCSC</name>
                            <description>EMC Shift Control. Controls how addresses are output on the
                                EMC address pins for static memories. Also see Section 10.9 in the
                                EMC chapter.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>STATIC_MEMORY_ADDRES</name>
                                    <description>Static memory addresses are shifted to match the
                                        data bus width. For example, when accessing a 32-bit wide
                                        data bus, the address is shifted right 2 places such that
                                        bit 2 is the LSB. In this mode, address bit 0 for the this
                                        device is connected to address bit 0 of the memory device,
                                        thus simplifying memory connections. This also makes a
                                        larger memory address range possible, because additional
                                        upper address bits can appear on the higher address pins due
                                        to the shift.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATIC_MEMORY_ADDRES</name>
                                    <description>Static memory addresses are always output as byte
                                        addresses regardless of the data bus width. For example,
                                        when word data is accessed on a 32-bit bus, address bits 1
                                        and 0 will always be 0. In this mode, one or both lower
                                        address bits may not be connected to memories that are part
                                        of a bus that is wider than 8 bits. This mode matches the
                                        operation of LPC23xx and LPC24xx devices.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EMCRD</name>
                            <description>EMC Reset Disable[1]. External Memory Controller Reset
                                Disable. Also see Section 10.8 in the EMC chapter.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BOTH_EMC_RESETS_ARE_</name>
                                    <description>Both EMC resets are asserted when any type of chip
                                        reset event occurs. In this mode, all registers and
                                        functions of the EMC are initialized upon any reset
                                        condition.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MANY_PORTIONS_OF_THE</name>
                                    <description>Many portions of the EMC are only reset by a
                                        power-on or brown-out event, in order to allow the EMC to
                                        retain its state through a warm reset (external reset or
                                        watchdog reset). If the EMC is configured correctly,
                                        auto-refresh can be maintained through a warm reset.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EMCBC</name>
                            <description>External Memory Controller burst control. Also see Section
                                10.10 in the EMC chapter.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BURST_ENABLED_</name>
                                    <description>Burst enabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BURST_DISABLED_THIS</name>
                                    <description>Burst disabled. This mode can be used to prevent
                                        multiple sequential accesses to memory mapped I/O devices
                                        connected to EMC static memory chip selects. These
                                        unrequested accesses can cause issues with some I/O devices.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCIPWRAL</name>
                            <description>MCIPWR Active Level[1]. Selects the active level of the SD
                                card interface signal SD_PWR.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SD_PWR_IS_ACTIVE_LOW</name>
                                    <description>SD_PWR is active low (inverted output of the SD
                                        Card interface block).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SD_PWR_IS_ACTIVE_HIG</name>
                                    <description>SD_PWR is active high (follows the output of the SD
                                        Card interface block).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSCRS</name>
                            <description>Main oscillator range select.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_FREQUENCY_RANGE_</name>
                                    <description>The frequency range of the main oscillator is 1 MHz
                                        to 20 MHz.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_FREQUENCY_RANGE_</name>
                                    <description>The frequency range of the main oscillator is 15
                                        MHz to 25 MHz.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSCEN</name>
                            <description>Main oscillator enable.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_MAIN_OSCILLATOR_</name>
                                    <description>The main oscillator is disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_MAIN_OSCILLATOR_</name>
                                    <description>The main oscillator is enabled, and will start up
                                        if the correct external circuitry is connected to the XTAL1
                                        and XTAL2 pins.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSCSTAT</name>
                            <description>Main oscillator status.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_MAIN_OSCILLATOR_</name>
                                    <description>The main oscillator is not ready to be used as a
                                        clock source.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_MAIN_OSCILLATOR_</name>
                                    <description>The main oscillator is ready to be used as a clock
                                        source. The main oscillator must be enabled via the OSCEN
                                        bit.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCLKSEL</name>
                    <description>Peripheral Clock Selection register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCLKDIV</name>
                            <description>Selects the divide value for the clock used for all APB
                                peripherals. 0 = The divider is turned off., no clock will be
                                provided to APB peripherals.. 1 = The input clock is divided by 1 to
                                produce the APB peripheral clock. 2 = The input clock is divided by
                                2 to produce the APB peripheral clock. 3 = The input clock is
                                divided by 3 to produce the APB peripheral clock. ... 31 = The input
                                clock is divided by 31 to produce the APB peripheral clock.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PBOOST</name>
                    <description>Power boost register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>Boost</name>
                            <description>Boost control bits. 00 : Boost is off, operation must be
                                below 100 MHz. 11 : Boost is on, operation up to 120 MHz is
                                supported. Other values are not allowed.</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPIFICLKSEL</name>
                    <description>SPIFI Clock Selection register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPIFIDIV</name>
                            <description>Selects the divide value for creating the SPIFI clock from
                                the selected clock source. 0 = The divider is turned off., no clock
                                will be provided to the SPIFI. 1 = The input clock is divided by 1
                                to produce the SPIFI clock. 2 = The input clock is divided by 2 to
                                produce the SPIFI clock. 3 = The input clock is divided by 3 to
                                produce the SPIFI clock. ... 31 = The input clock is divided by 31
                                to produce the SPIFI clock.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                        <field>
                            <name>SPIFISEL</name>
                            <description>Selects the input clock for the USB clock divider.</description>
                            <bitRange>[9:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SYSCLK_IS_USED_AS_TH</name>
                                    <description>Sysclk is used as the input to the SPIFI clock
                                        divider.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_OUTPUT_OF_THE_MA</name>
                                    <description>The output of the Main PLL is used as the input to
                                        the SPIFI clock divider.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_OUTPUT_OF_THE_AL</name>
                                    <description>The output of the Alt PLL is used as the input to
                                        the SPIFI clock divider.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCD_CFG</name>
                    <description>LCD Clock configuration register</description>
                    <addressOffset>0x1B8</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLKDIV</name>
                            <description>LCD panel clock prescaler selection. The value in the this
                                register plus 1 is used to divide the selected input clock (see the
                                CLKSEL bit in the LCD_POL register), to produce the panel clock.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
