itzandroidtab/klib-svd/lpc1788.svd
                <register>
                    <name>RSTCON1</name>
                    <description>Individual peripheral reset control bits</description>
                    <addressOffset>0x1D0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RSTIOCON</name>
                            <description>Reset control bit for the IOCON registers.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RSTDAC</name>
                            <description>D/A converter (DAC) reset control bit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RSTCANACC</name>
                            <description>CAN acceptance filter reset control bit.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:3]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMCDLYCTL</name>
                    <description>Values for the 4 programmable delays associated with SDRAM
                        operation.</description>
                    <addressOffset>0x1DC</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x210</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDDLY</name>
                            <description>Programmable delay value for EMC outputs in command delayed
                                mode. See Section 10.12.6. The delay amount is roughly (CMDDLY+1) *
                                250 picoseconds. This field applies only when the command delayed
                                read strategy is selected in the EMCDynamicReadConfig register. In
                                this mode, all control outputs from the EMC are delayed, but the
                                output clock is not. Delaying the control outputs changes dynamic
                                characteristics defined in the device data sheet.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:5]</bitRange>
                        </field>
                        <field>
                            <name>FBCLKDLY</name>
                            <description>Programmable delay value for the feedback clock that
                                controls input data sampling. See Section 10.5.3. The delay amount
                                is roughly (FBCLKDLY+1) * 250 picoseconds.</description>
                            <bitRange>[12:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[15:13]</bitRange>
                        </field>
                        <field>
                            <name>CLKOUT0DLY</name>
                            <description>Programmable delay value for the CLKOUT0 output. This would
                                typically be used in clock delayed mode. See Section 10.12.6 The
                                delay amount is roughly (CLKOUT0DLY+1) * 250 picoseconds. Delaying
                                the clock output changes dynamic characteristics defined in the
                                device data sheet.</description>
                            <bitRange>[20:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[23:21]</bitRange>
                        </field>
                        <field>
                            <name>CLKOUT1DLY</name>
                            <description>Programmable delay value for the CLKOUT1 output. This would
                                typically be used in clock delayed mode. See Section 10.12.6 The
                                delay amount is roughly (CLKOUT1DLY+1) * 250 picoseconds.</description>
                            <bitRange>[28:24]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:29]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EMCCAL</name>
                    <description>Controls the calibration counter for programmable delays and
                        returns the result value.</description>
                    <addressOffset>0x1E0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x1F00</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CALVALUE</name>
                            <description>Returns the count of the approximately 50 MHz ring
                                oscillator that occur during 32 clocks of the IRC oscillator. This
                                represents the composite effect of processing variation, internal
                                regulator supply voltage, and ambient temperature.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[13:8]</bitRange>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Start control bit for the EMC calibration counter. Writing
                                a 1 to this bit begins the measurement process. This bit is cleared
                                automatically when the measurement is complete.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>DONE</name>
                            <description>Measurement completion flag. this bit is set when a
                                calibration measurement is completed. This bit is cleared
                                automatically when the START bit is set.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>